[
    {
        "id": 51729,
        "date": "2026-02-23T12:08:58",
        "date_gmt": "2026-02-23T17:08:58",
        "guid": {
            "rendered": "https://streetcarsuburbs.news/?p=51729"
        },
        "modified": "2026-02-23T12:09:00",
        "modified_gmt": "2026-02-23T17:09:00",
        "slug": "five-things-to-know-during-hyattsvilles-budget-season",
        "status": "publish",
        "type": "post",
        "link": "https://streetcarsuburbs.news/five-things-to-know-during-hyattsvilles-budget-season/",
        "title": {
            "rendered": "Five things to know during Hyattsville’s budget season"
        },
        "content": {
            "rendered": "\n<p>The City of Hyattsville is gearing up to decide how to spend more than $30 million for the year starting July 1, 2026, known as fiscal year 2027 or FY 2027. Here are your answers to five questions you may have about Hyattsville’s budgets. </p>\n\n\n\n<p><strong>1. What are residents advocating for this year so far?&nbsp;&nbsp;</strong></p>\n\n\n\n<p>During the public comment period of the <a href=\"https://hyattsvillemd.portal.civicclerk.com/event/3106/files/agenda/5189\">Feb. 9 city council meeting</a>, resident Brian Banks was one of four residents who advocated for “a dramatically increased budget” for the city’s community services department.</p>\n\n\n\n<p>&nbsp;“We have entire communities that are having really severe impacts as they lose members of their family, as they lose their breadwinners in a lot of cases,” he said. “The department of community services is uniquely positioned to provide support.”&nbsp;</p>\n\n\n\n<p>The money would be used for case management and coordination to support residents who had lost income due to U.S. Immigration and Customs Enforcement activity.&nbsp;</p>\n\n\n\n<p>Resident Charlotte Frankor, who also supported increased community services funding, asked the city to look at funding for bike share stations, too.&nbsp;</p>\n\n\n\n<p><strong>2. Will property taxes increase?&nbsp;</strong></p>\n\n\n\n<p>The Hyattsville City Council will set the tax rate for the coming year this spring. City Administrator Tracey Douglas said in a <a href=\"https://hyattsvillemd.portal.civicclerk.com/event/3121/files/agenda/5206\">first budget workshop on Feb. 18</a> that council should consider having a conversation about an increase in the property tax rate in order to accomplish their goals.&nbsp;</p>\n\n\n\n<p>The city’s property tax rate has stayed the same for 20 years — <a href=\"https://www.hyattsville.org/DocumentCenter/View/6669/FY23-City-of-Hyattsville-Budget-Book\">63 cents for every $100 of assessed value</a>. However, as home values have increased and new homes have been built, city revenue has increased.</p>\n\n\n\n<p><strong>3. How much money does the city bring in every year?</strong></p>\n\n\n\n<p>During the fiscal year ending in the summer of 2026 (FY 2026), Hyattsville will collect more than $20.5 million in property taxes, according to Ron Brooks, the city treasurer.</p>\n\n\n\n<p>That’s close to <a href=\"https://www.hyattsville.org/DocumentCenter/View/3793/FY16-Proposed-Budget?bidId=\">double the amount</a> collected 10 years ago, $10.8 million in 2016.&nbsp;</p>\n\n\n\n<p>Overall city revenue from all sources has doubled in the past 10 years as well, from $15.5 million to a forecast $32 million, according to Brooks in the Feb.18 city budget meeting. In addition, Hyattsville has had nearly $18 million in COVID relief funding to spend during the past five years.</p>\n\n\n\n<p>Hyattsville’s population has risen too, though not as fast, from about <a href=\"https://worldpopulationreview.com/us-cities/maryland/hyattsville\">18,000 to about 21,000</a> in the last 10 years.&nbsp;</p>\n\n\n\n<p><strong>4. Does the city’s income cover its costs?&nbsp;</strong></p>\n\n\n\n<p>In recent years, Hyattsville has passed budgets that anticipate expenses higher than revenue, and transfers from a general fund — or savings — to cover those transfers.&nbsp;</p>\n\n\n\n<p>The city also has unfunded long-term obligations, the total current size of which is unclear, in part because the city is behind on audits.</p>\n\n\n\n<p>The most recent audit available shows that the city’s debt more than tripled over 10 years, to <a href=\"https://www.hyattsville.org/DocumentCenter/View/8833/City-of-Hyattsville-FY23-Audited-Financial-Statements-4-1-2025?bidId=\">$62 million</a> in long-term liabilities in FY 2023. These debts include municipal bonds — often money borrowed for construction — and retiree medical benefits. Retiree medical care liability <a href=\"https://md-hyattsville2.civicplus.com/DocumentCenter/View/3597/FY13-Audit?bidId=\">ballooned</a> from $2 million to $22 million over the same 10 years.&nbsp;</p>\n\n\n\n<p>Hyattsville has been <a href=\"https://streetcarsuburbs.news/promotions-fill-key-city-vacancies/\">at least two years behind</a> on required annual audits since 2009. Treasurer Brooks’ predecessor, the third treasurer in three years, <a href=\"https://streetcarsuburbs.news/turmoil-at-city-hall-as-city-administrator-and-treasurer-resign/\">quit in 2012</a> due to controversy over late audits, at a time when we reported that Hyattsville was further behind than any other city in the state.&nbsp;</p>\n\n\n\n<p>Following the formation of a volunteer city audit committee, staffed with local finance professionals, Hyattsville filed their FY2023 audit only about a year and a half late in March 2025. The city has since switched auditors, and is bringing the new auditors up to speed, Brooks said at the <a href=\"https://hyattsvillemd.portal.civicclerk.com/event/2098/files/agenda/5166\">Jan. 27 city council meeting</a>. The FY 2024 audit is not complete as of press time; nor is the FY 2025 audit, which was due October 2025.</p>\n\n\n\n<p><strong>5. Why is the city still behind on its audits?</strong></p>\n\n\n\n<p>It is hard to catch up when the race keeps getting faster. During the Jan. 27 meeting, Brooks said that the number of financial transactions that his department records per year has tripled since he <a href=\"https://streetcarsuburbs.news/promotions-fill-key-city-vacancies/\">came on board in 2013</a>.</p>\n\n\n\n<p>During much of that time, the city has attempted to implement software to improve accounting and financial management, known as enterprise resource planning (ERP) software. The city’s new audit committee recommends prioritizing rollout of ERP software along with other recommendations to improve speed and accuracy in accounting.&nbsp;</p>\n\n\n\n<p>On Jan. 27, Brooks said he was going to have to scrap the ERP system he had been trying to implement for the past five years, and look for a new software vendor. He said the market for ERP systems has changed, and the new system needs to have AI features and be designed for small governments. Brooks explained that BC Systems, the software he had been working with, was difficult to use and not giving accurate results.</p>\n\n\n\n<p><em>Route One Finance</em>, a public finance watchdog blog, reported that it has obtained receipts showing that, as of August, Hyattsville had paid BC Systems $330,000 under its five-year contract. It’s been a long road, and a public accounting of the cost would be its own audit project. Council began allocating funds to <a href=\"https://hyattsville-md.granicus.com/DocumentViewer.php?file=hyattsville-md_0df772f146ef80e7559c8daea87e0a99.pdf&amp;view=1\">ERP implementation in 2013</a>.&nbsp;&nbsp;</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>The City of Hyattsville is gearing up to decide how to spend more than $30 million for the year starting July 1, 2026, known as fiscal year 2027 or FY 2027. Here are your answers to five questions you may have about Hyattsville’s budgets. 1. What are residents advocating for this year so far?&nbsp;&nbsp; During [&hellip;]</p>\n",
            "protected": false
        },
        "author": 12,
        "featured_media": 51731,
        "comment_status": "closed",
        "ping_status": "closed",
        "sticky": false,
        "template": "",
        "format": "standard",
        "categories": [
            3,
            2
        ],
        "tags": [
            3261,
            887,
            1464,
            4473
        ],
        "coauthors": [
            4304
        ],
        "jetpack_publicize_connections": [],
        "jetpack_featured_media_url": "https://i0.wp.com/streetcarsuburbs.news/wp-content/uploads/2026/02/calculator-calculation-insurance-finance-53621.jpeg?fit=1880%2C1107&ssl=1",
        "jetpack-related-posts": [],
        "jetpack_sharing_enabled": true
    }
]