{
  "date": "2026-02-08",
  "entry_count": 22,
  "entries": [
    {
      "title": "Lake County mother, boyfriend charged in death of 8-year-old boy",
      "link": "https://chicago.suntimes.com/crime/2026/02/07/lake-county-mother-boyfriend-charged-in-death-of-8-year-old-boy",
      "published": "2026-02-07T21:08:48.369-06:00",
      "published_parsed": "2026-02-08T03:08:48",
      "summary": "<img alt=\"A man and woman from Round Lake Beach have been charged in the death of an 8-year-old boy who authorities say showed signs of abuse and malnourishment. A 10-year-old in the home showed similar signs.\" src=\"https://cst.brightspotcdn.com/dims4/default/6c29724/2147483647/strip/true/crop/890x630+0+0/resize/840x595!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F0f%2F35%2F99b2b7dfd19b2a816025a9201cce%2Fround-lake-beach-e1540321241436.jpg\" />\n        \n        \n            &lt;p&gt;A Lake County couple has been charged with murder and child endangerment after an 8-year-old boy found in their home Friday died.&lt;/p&gt;&lt;p&gt;Round Lake Beach police were called for an unresponsive child about 2 p.m. to their home in the 1900 block of Cedar Lake Road, police said.&lt;/p&gt;&lt;p&gt;They found the boy and performed CPR until paramedics arrived. The boy was taken to a nearby hospital, where he was pronounced dead, police said.&lt;/p&gt;&lt;p&gt;Preliminary autopsy findings indicated the boy suffered from malnourishment and physical abuse, police said.&lt;/p&gt;&lt;p&gt;The boy’s 10-year-old brother was hospitalized after speaking with the Lake County Children's Advocacy Center, which determined he also showed signs of abuse and malnourishment. Their step-sibling, a 3-year-old boy, also lived at the home and was placed in the care of the state Department of Children and Family Services, police said.&lt;/p&gt;&lt;p&gt;The children’s mother, Dominique Servant, 33, and her boyfriend, Joey Ruffin, 38, were taken into custody Friday night, police said. Both are charged with two counts of first-degree murder and one count of child endangerment causing death.&lt;/p&gt;&lt;p&gt;Authorities are attempting to contact the children's biological father, police said.&lt;/p&gt;&lt;p&gt;Servant and Ruffin are due in court Sunday morning.&lt;/p&gt;",
      "author": "Sun-Times Wire",
      "id": "https://chicago.suntimes.com/crime/2026/02/07/lake-county-mother-boyfriend-charged-in-death-of-8-year-old-boy",
      "tags": []
    },
    {
      "title": "Help Wanted: Bulls future guards needed and 10-week tryout required",
      "link": "https://chicago.suntimes.com/bulls/2026/02/07/bulls-future-guards-needed-10-week-tryout-required",
      "published": "2026-02-07T20:33:34.447-06:00",
      "published_parsed": "2026-02-08T02:33:34",
      "summary": "<img alt=\"Jaden Ivey made his home debut with his new Bulls team on Saturday, as did fellow new guards Anfernee Simons, Rob Dillingham and Collin Sexton , \" src=\"https://cst.brightspotcdn.com/dims4/default/fd2c2c5/2147483647/strip/true/crop/3080x2053+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fee%2Fa7%2F34f5a414403f993b46f5e1881dd3%2F2260455945.jpg\" />\n        \n        \n            &lt;p&gt;It was an interesting way of thinking about it.&lt;/p&gt;&lt;p&gt;Anfernee Simons headlines a group of newly-acquired Bulls players that are basically in a 10-week job interview with their new organization, but the 26-year-old had a unique take on it all.&lt;/p&gt;&lt;p&gt;“I think even before (the trade) it was always going to be a job interview with this being my last year (of the current contract),” Simons said. “I just got to make the most out of these last couple months, being here, start building chemistry with the guys and see where that goes.”&lt;/p&gt;&lt;p&gt;OK, for some it’s been an on-going six-month tryout.&lt;/p&gt;&lt;p&gt;And the part the Bulls play in all of this? Another important evaluation test for a front office that has more fails than passes in that department.&lt;/p&gt;&lt;p&gt;In adding four guards in the week leading up to the Feb. 5 trade deadline, the Bulls gave themselves a runway of 30 games – including Saturday’s – to evaluate Simons, Collin Sexton, Rob Dillingham and Jaden Ivey.&lt;/p&gt;&lt;p&gt;Simons and Sexton are in the final years of their current contracts and will become unrestricted free agents, while Ivey will be a restricted free agent. Dillingham is on his rookie contract but considering how poorly things were going in Minnesota for him, the Bulls need to find out why and was it fixable.&lt;/p&gt;&lt;p&gt;Not an ideal situation for the team to be in considering they are in a rebuild – or as executive vice president of basketball operations Arturas Karnisovas says, a new “stage – and every decision has consequences that help the seed grow or kill it.&lt;/p&gt;&lt;p&gt;“At the end of the day I tell myself, ‘Hey, just be where the feet are at,’ “ Sexton said of his approach to the rest of the season. “Don’t look too far in advance and when I’m doing that I feel like I’m at my best. Just give it my all for this organization, give my all to this team, show them what I can do. I just know that’s something I can control. Each and every day coming in with the right energy. Being a true professional is something I can control and the rest will take care of itself.”&lt;/p&gt;&lt;p&gt;That’s where coach Billy Donovan comes in.&lt;/p&gt;&lt;p&gt;Karnisovas and general manager Marc Eversley can watch the basketball part of their new guard room, but it’s Donovan that will be with the players on an almost daily basis between now and mid-April.&lt;/p&gt;&lt;p&gt;“For me a lot of it comes down to the way I look at from the lens of the mentality piece,” Donovan said on Saturday. “That’s kind of what I’m looking at. To me it’s more of the competitiveness, the mentality, how are they in the locker room, how are they as teammates, can they follow game-plan discipline, all those types of things.”&lt;/p&gt;&lt;p&gt;Donovan admitted that he had a meeting with the front office on Friday to figure out playing time and if they had an edict on a minutes priority. After all, it would make sense to see more of Dillingham and Ivey since they are more likely to be kept, but Donovan said there was none of that.&lt;/p&gt;&lt;p&gt;“I think at least the feeling from the front office was they wanted to see kind of all these guys that are in here right now,” Donovan said. “It hasn’t been, ‘Hey, we want you to play this guy, this guy.’ They want these guys to go out and compete, see how well they can fit in to how we’ve been trying to play.”&lt;/p&gt;&lt;p&gt;Music to Dillingham’s ears, who was begging for a new start after a season-and-a-half with the Timberwolves and diminishing minutes.&lt;/p&gt;&lt;p&gt;Job interview? For the second-year guard it almost feels like a career change.&lt;/p&gt;&lt;p&gt;“I’m just trying to show I can play basketball, I belong here and I can help the team win,” Dillingham said. “I’m not looking at it as something specific.”&lt;/p&gt;",
      "author": "Joe Cowley",
      "id": "https://chicago.suntimes.com/bulls/2026/02/07/bulls-future-guards-needed-10-week-tryout-required",
      "tags": []
    },
    {
      "title": "Big, physical York's unlikely success continues with a win at Libertyville",
      "link": "https://chicago.suntimes.com/high-school-basketball/2026/02/07/york-basketball-elmhurst-libertyville",
      "published": "2026-02-07T20:23:01.955-06:00",
      "published_parsed": "2026-02-08T02:23:01",
      "summary": "<img alt=\"York’s Hunter Stepanich (50) goes to the basket against Libertyville.\" src=\"https://cst.brightspotcdn.com/dims4/default/562950c/2147483647/strip/true/crop/6216x4147+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F82%2F34%2F5b0cf4bc494db3cdabce3b923aca%2Fob-cst-020826-008.jpg\" />\n        \n        \n            &lt;p&gt;York is the area’s most physical team. The &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/super-25-basketball-rankings/2026/02/01/high-school-basketball-rankings-chicago-illinois-sun-times-michael-obrien\"   &gt;No. 20 Dukes&lt;/a&gt; pack the paint with three big, wide, strong and smart football players.&lt;/p&gt;&lt;p&gt;Hunter Stepanich, a 6-7 tight end, is heading to Princeton. Georgetown Costa Kampas is a 6-5, 275-pound powerhouse offensive tackle, and 6-4 Jackson Rennick is a lineman heading to Wisconsin-Whitewater.&lt;/p&gt;&lt;p&gt;\"We know we are probably one of the most physical teams in the state and one of the best rebounding teams, so we play to our strengths,\" Stepanich said. \"Our defense is the trademark of the team. The guys are all getting up and pressuring because when someone gets through there is me, Costa and Jackson. We can clean up down low and cover the corners. Our defense makes people uncomfortable, and we capitalize on that.\"&lt;/p&gt;&lt;p&gt;York held host Libertyville without a field goal in the third quarter on &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/high-school-basketball/scores/2026/02/07/chicago-high-school-basketball-scores-illinois\"   &gt;Saturday&lt;/a&gt; and went on to win 47-41.&lt;/p&gt;&lt;p&gt;The Dukes (24-4) have used their size and bulk to become the area's most surprisingly successful team.&lt;/p&gt;&lt;p&gt;\"If you would have told us we'd be 24-4 right now we would have said you are crazy,\" York coach Mike Dunn said. \"But our kids believe and there is a great bond on the team. They like each other and they hang out with each other outside of basketball. That makes things a lot easier.\"&lt;/p&gt;&lt;p&gt;Junior Joseph Ubbe led the Dukes with 17 points and Stepanich added 12 points and seven rebounds. Stepanich was matched up against Libertyville's 6-9 Bryce Wegrzyn in a rare big-man battle.&lt;/p&gt;&lt;p&gt;\"I've played against him a few times and he's a great player,\" Stepanich said. \"I've seen him get better and better the past few years and I was excited for this game. There aren't many big man battles, so it is always a good time when one comes around.\"&lt;/p&gt;&lt;p&gt;Wegrzyn, a Winona State recruit, hurt his eye early in the second half and finished with 10 points. He tried to play through it for a while, but spent most of the fourth quarter on the bench.&lt;/p&gt;&lt;p&gt;\"His vision was blurry and I didn't see any point in risking anything,\" Libertyville coach Brian Zyrkowski said.&lt;/p&gt;&lt;p&gt;Senior guard Trevor Wallace led the Wildcats (14-9) with 12 points. Libertyville trailed by 12 points with 6:32 left but made three three-pointers to tighten things up. A three from Ben Kristopher with 34 seconds left cut the deficit to 46-41 but that was as close it would get.&lt;/p&gt;&lt;p&gt;York's football team has made deep playoff runs the past several years, but that wasn't the case this season.&lt;/p&gt;&lt;p&gt;\"I do think it impacted the team,\" Kampas said. \"The brotherhood this year is really special. And being with the team for 2 to 3 weeks longer made a difference. This is an incredibly close-knit group.\"&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-d40000\" name=\"image-d40000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/a8d0c8c/2147483647/strip/true/crop/6940x3895+0+0/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F36%2F22%2F5b826ab1457485e1c83d428cd993%2Fob-cst-020826-007.jpg 1x,https://cst.brightspotcdn.com/dims4/default/196d303/2147483647/strip/true/crop/6940x3895+0+0/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F36%2F22%2F5b826ab1457485e1c83d428cd993%2Fob-cst-020826-007.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/ebfe312/2147483647/strip/true/crop/6940x3895+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F36%2F22%2F5b826ab1457485e1c83d428cd993%2Fob-cst-020826-007.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"York’s Jackson Rennick (52) chest bumps Joseph Lubbe (25) during the game against Libertyville.\" srcset=\"https://cst.brightspotcdn.com/dims4/default/ebfe312/2147483647/strip/true/crop/6940x3895+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F36%2F22%2F5b826ab1457485e1c83d428cd993%2Fob-cst-020826-007.jpg 1x,https://cst.brightspotcdn.com/dims4/default/4a04384/2147483647/strip/true/crop/6940x3895+0+0/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F36%2F22%2F5b826ab1457485e1c83d428cd993%2Fob-cst-020826-007.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/ebfe312/2147483647/strip/true/crop/6940x3895+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F36%2F22%2F5b826ab1457485e1c83d428cd993%2Fob-cst-020826-007.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;York’s Jackson Rennick (52) chest bumps Joseph Lubbe (25) during the game against Libertyville.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Kirsten Stickney/For the Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;York's coaching staff has been surprised by the team's success, but the senior leaders had this in mind all along.&lt;/p&gt;&lt;p&gt;\"This was our opportunity to step up and lead as a senior class, and we always knew we would be ready,\" Stepanich said. \"And our coaches put us in a great position to make it happen.\"&lt;/p&gt;&lt;p&gt;\"This is awesome, playing with some friends I've known since I was 5 years old and having this success,\" Kampas said.&lt;/p&gt;&lt;p&gt;The Dukes won ten consecutive games before losing to Lyons on Tuesday. Their other three losses are also to quality teams: Batavia, Fremd and Hersey.&lt;/p&gt;&lt;p&gt;\"Our kids play extremely hard and obviously we have some big boys and we try to utilize them,\" Dunn said. \"I'm proud of our kids. Nobody expected us to be where we are at and we keep trying to win the next one and get better every day.\"&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-3d0000\" name=\"html-embed-module-3d0000\"&gt;&lt;/a&gt;&lt;iframe title=\"No Shot Clock, Ep. 200: The Stock Report\" allowtransparency=\"true\" height=\"150\" width=\"100%\" style=\"border: none; min-width: min(100%, 430px);height:150px;\" scrolling=\"no\" data-name=\"pb-iframe-player\" src=\"https://www.podbean.com/player-v2/?i=c8wjb-1a372d3-pb&amp;from=pb6admin&amp;share=1&amp;download=1&amp;rtl=0&amp;fonts=Arial&amp;skin=1&amp;font-color=auto&amp;logo_link=episode_page&amp;btn-skin=c73a3a\" loading=\"lazy\"&gt;&lt;/iframe&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Michael O'Brien",
      "id": "https://chicago.suntimes.com/high-school-basketball/2026/02/07/york-basketball-elmhurst-libertyville",
      "tags": []
    },
    {
      "title": "Chicago Auto Show's Chi-Town Alley celebrates best of the city's 'hidden' car culture",
      "link": "https://chicago.suntimes.com/arts-and-culture/2026/02/07/chicago-auto-shows-chi-town-alley-car-culture",
      "published": "2026-02-07T19:18:01.595-06:00",
      "published_parsed": "2026-02-08T01:18:01",
      "summary": "<img alt=\"Alan Castro stands next to his Nissan Skyline GTR R34 at the Chicago Auto Show at McCormick Place, which opened Saturday.\" src=\"https://cst.brightspotcdn.com/dims4/default/7f8b288/2147483647/strip/true/crop/5314x3543+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F75%2Fd5%2Fe0e8b95c4210859a1ed37aedcf46%2Fautoshow-260208-02.jpg\" />\n        \n        \n            &lt;p&gt;Back in 1991, Matt Conger spotted a Toyota MR2 Turbo at the Chicago Auto Show.&lt;/p&gt;&lt;p&gt;Four years later, he scraped money together to buy his own in crimson red.&lt;/p&gt;&lt;p&gt;Now, after 31 years, 49 oil changes, 56 spark plugs and 11 sets of tires, his car is on display as part of the Chi-Town Alley exhibit at &lt;a class=\"Link\"  href=\"https://www.chicagoautoshow.com/\"  target=\"_blank\"   &gt;the 2026 show&lt;/a&gt;, which kicked off Saturday and runs through Feb. 16 at McCormick Place&lt;b&gt;. &lt;/b&gt;The vehicle was also selected as one of six finalists in a contest celebrating the best of Chicago’s car culture. Votes cast by attendees will determine the winner once the event closes.&lt;/p&gt;&lt;p&gt;“I am so humbled,” said Conger, 54, of West Chicago. “Winning, to me, is just being here, taking part in all this and helping start a new exhibit. I hope it stays.”&lt;/p&gt;&lt;div class=\"RelatedList Enhancement\" data-module data-align-center&gt;\n    \n     &lt;div class=\"RelatedList-title\"&gt;Related&lt;/div&gt;\n    \n\n    \n        &lt;ul class=\"RelatedList-items\"&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/metro-state/2025/02/08/chicago-auto-show-2025-mccormick-place-evs-suvs-cars\"   &gt;Chicago Auto Show offers families hands-on time with electric vehicles, SUVs and muscle cars&lt;/a&gt;\n                &lt;/li&gt;\n            \n        &lt;/ul&gt;\n    \n&lt;/div&gt;\n&lt;p&gt;A new attraction this year, Chi-Town Alley also features a variety of vehicles owned by local enthusiasts, including a sleek, 1975 Datsun and an eye-catching 1995 Porsche 911 RWB Sandstorm. Also on display is a row of gleaming Mustangs and tricked-out lowriders from car clubs in the region. The exhibit was created to encourage community-building and celebrate Chicago’s car scene, which participants say is full of talent but not widely recognized.&lt;/p&gt;&lt;p&gt;“We are very passionate about our cars, but I have enough friends on the West Coast and the East Coast who think we're just simple Midwesterners,” Conger said. “They don't know what we bring and the status of our cars, because they just think we live in cornfields. [The culture] is very strong, but hidden.”&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-580000\" name=\"image-580000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/de77d2b/2147483647/strip/true/crop/4950x2778+0+261/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2F0d%2F109417fb4b7fb5f7829b693bb26e%2Fautoshow-260208-04.jpg 1x,https://cst.brightspotcdn.com/dims4/default/1544ff1/2147483647/strip/true/crop/4950x2778+0+261/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2F0d%2F109417fb4b7fb5f7829b693bb26e%2Fautoshow-260208-04.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/72638c2/2147483647/strip/true/crop/4950x2778+0+261/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2F0d%2F109417fb4b7fb5f7829b693bb26e%2Fautoshow-260208-04.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Matt Conger with his Toyota MR2. “I am so humbled,” Conger said of being selected to be among the inaugural group of cars chosen for the first Chi-Town Alley display.  \" srcset=\"https://cst.brightspotcdn.com/dims4/default/72638c2/2147483647/strip/true/crop/4950x2778+0+261/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2F0d%2F109417fb4b7fb5f7829b693bb26e%2Fautoshow-260208-04.jpg 1x,https://cst.brightspotcdn.com/dims4/default/1bf1740/2147483647/strip/true/crop/4950x2778+0+261/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2F0d%2F109417fb4b7fb5f7829b693bb26e%2Fautoshow-260208-04.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/72638c2/2147483647/strip/true/crop/4950x2778+0+261/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2F0d%2F109417fb4b7fb5f7829b693bb26e%2Fautoshow-260208-04.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Matt Conger with his Toyota MR2. “I am so humbled,” Conger said of being selected to be among the Chi-Town Alley Showcase finalists.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Giacomo Cain/Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;div class=\"RichTextSidebarModule Enhancement\" data-module data-align-center&gt;&lt;a class=\"AnchorLink\" id=\"module-310000\" name=\"module-310000\"&gt;&lt;/a&gt;\n\n    \n\n    \n    &lt;div class=\"RichTextModule-items RichTextBody\"&gt;&lt;b&gt;Chicago Auto Show&lt;/b&gt;&lt;br&gt;&lt;br&gt;&lt;b&gt;When:&lt;/b&gt; Through Feb. 16&lt;br&gt;&lt;br&gt;&lt;b&gt;Where:&lt;/b&gt; McCormick Place, 2301 S. King Drive&lt;br&gt;&lt;br&gt;&lt;b&gt;Tickets/Info:&lt;/b&gt; &lt;a class=\"Link\"  href=\"https://www.chicagoautoshow.com/\"  target=\"_blank\"   &gt;chicagoautoshow.com&lt;/a&gt;&lt;/div&gt;\n\n\n&lt;/div&gt;&lt;p&gt;In addition to Chi-Town Alley, the auto show features the usual popular attractions, including kid-friendly activities in the Family Zone, off-roading vehicles in the Overlanding Chicago area, and even indoor and outdoor test tracks. On Saturday, attendees lined up to pet dogs that were part of an adoption initiative hosted by Subaru. They also participated in a meet and greet with “Fast &amp;amp; Furious” franchise actor Sung Kang, who made an appearance.&lt;/p&gt;&lt;p&gt;“This is the biggest auto show I’ve ever been to,” said Kang, 52, of Los Angeles, who has directed his own racing film, “Drifter,” which does not yet have a release date.&lt;/p&gt;&lt;p&gt;Kang said he learned about Chicago’s car culture while filming an episode of his Insight TV reality show, “The Ride Life,” in the city a couple of years ago.&lt;/p&gt;&lt;p&gt;“Chicago is awesome because it's very diverse,” he said. “There's such a mixture of different ethnic groups.The car culture is not just one color. Everyone came together to celebrate this common love of cars.”&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-b20000\" name=\"image-b20000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/db10f6c/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F08%2Fda%2F3ec4a7e44c9f9ecc6f5b4d283bbf%2Fautoshow-260208-06.jpg 1x,https://cst.brightspotcdn.com/dims4/default/e5a7430/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F08%2Fda%2F3ec4a7e44c9f9ecc6f5b4d283bbf%2Fautoshow-260208-06.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/3cd071a/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F08%2Fda%2F3ec4a7e44c9f9ecc6f5b4d283bbf%2Fautoshow-260208-06.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Actor and director Sung Kang speaks with fans during the Chicago Auto Show at McCormick place on Saturday, Feb. 7, 2026. Kang was there advertising his upcoming movie &amp;quot;Drifter.&amp;quot;\" srcset=\"https://cst.brightspotcdn.com/dims4/default/3cd071a/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F08%2Fda%2F3ec4a7e44c9f9ecc6f5b4d283bbf%2Fautoshow-260208-06.jpg 1x,https://cst.brightspotcdn.com/dims4/default/a565428/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F08%2Fda%2F3ec4a7e44c9f9ecc6f5b4d283bbf%2Fautoshow-260208-06.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/3cd071a/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F08%2Fda%2F3ec4a7e44c9f9ecc6f5b4d283bbf%2Fautoshow-260208-06.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Actor-director Sung Kang speaks with fans during the Chicago Auto Show at McCormick Place on Saturday. “This is the biggest auto show I’ve ever been to.”&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Giacomo Cain/Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;Many of the city’s car enthusiasts also share a common story of gaining an appreciation for the culture from their parents. Among them is Alan Castro, another Chi-Town Alley contest finalist who was influenced by his father.&lt;/p&gt;&lt;p&gt;“It got me out of trouble,” said Castro, 37, of Elgin, whose bayside blue 1998 Nissan R34 Skyline is on display. “Instead of doing other things, I’d rather build cars. You can just sit for hours in the garage thinking, ‘What should I do next? When's the next event?’”&lt;/p&gt;&lt;p&gt;Similarly, Ryan Rivera, another contest finalist, learned how to build cars from his father, who worked in a body shop in Puerto Rico as a kid.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-340000\" name=\"image-340000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/4d69312/2147483647/strip/true/crop/5089x2856+0+268/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fba%2F28%2F45025fb049ecb2fce3c6a1c1caab%2Fautoshow-260208-05.jpg 1x,https://cst.brightspotcdn.com/dims4/default/5407f5f/2147483647/strip/true/crop/5089x2856+0+268/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fba%2F28%2F45025fb049ecb2fce3c6a1c1caab%2Fautoshow-260208-05.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/2ab212f/2147483647/strip/true/crop/5089x2856+0+268/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fba%2F28%2F45025fb049ecb2fce3c6a1c1caab%2Fautoshow-260208-05.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Ryan Rivera stands next to his Acura Integra Type-S. Rivera learned how to build cars from his dad, who worked in a body shop in Puerto Rico.\" srcset=\"https://cst.brightspotcdn.com/dims4/default/2ab212f/2147483647/strip/true/crop/5089x2856+0+268/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fba%2F28%2F45025fb049ecb2fce3c6a1c1caab%2Fautoshow-260208-05.jpg 1x,https://cst.brightspotcdn.com/dims4/default/fcee36b/2147483647/strip/true/crop/5089x2856+0+268/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fba%2F28%2F45025fb049ecb2fce3c6a1c1caab%2Fautoshow-260208-05.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/2ab212f/2147483647/strip/true/crop/5089x2856+0+268/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fba%2F28%2F45025fb049ecb2fce3c6a1c1caab%2Fautoshow-260208-05.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Ryan Rivera stands next to his Acura Integra Type-S. Rivera learned how to build cars from his dad, who worked in a body shop in Puerto Rico.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Giacomo Cain/Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;When Rivera was growing up, he watched his father work on cars at home and then eventually started helping him. They also attended the Chicago Auto Show together. Having his yellow 2024 Acura Integra on display at this year’s event is “surreal,” said Rivera, 37, of Portage Park.&lt;/p&gt;&lt;p&gt;“I kind of want to sit on the floor when there's nobody here and just look up and take in the moment,” he said.&lt;/p&gt;&lt;p&gt;The Chicago car scene is growing, as younger enthusiasts are picking up the mantle. For example, the Chicago Auto Show’s social media is managed by Capture Company, a Chicago-based marketing firm owned by 21-year-old college student Marcel Sutkowski.&lt;/p&gt;&lt;p&gt;Once a teenager taking pictures of cars at the event, Sutkowski said he was inspired by the culture.&lt;/p&gt;&lt;div class=\"RelatedList Enhancement\" data-module data-align-center&gt;\n    \n     &lt;div class=\"RelatedList-title\"&gt;Related&lt;/div&gt;\n    \n\n    \n        &lt;ul class=\"RelatedList-items\"&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/transportation/2026/02/07/drivers-license-reinstatement-expo-courts-transportation\"   &gt;Teams of lawyers put drivers back on the road by reinstating suspended licenses&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/art/2025/10/12/slow-and-low-lowrider-festival-navy-pier-cars-bikes-chicano-culture\"   &gt;Lowrider festival showcases Latino car culture and artistry at Navy Pier&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/entertainment-culture/2025/08/30/slaughterhouse-31-vespa-scooter-rally\"   &gt;Photos: Vespa enthusiasts show off their personality and style during annual Chicago rally&lt;/a&gt;\n                &lt;/li&gt;\n            \n        &lt;/ul&gt;\n    \n&lt;/div&gt;\n&lt;p&gt;“The auto show brings so many people together, and it's just an incredible time,” said Sutkowski, who grew up in the northwest suburbs and now attends Purdue University. “Look how many families are here. Look at all the couples. Look at all of the students. It’s a cool community.”&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-f20000\" name=\"image-f20000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/fd31e80/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fca%2F0d%2Fd14d087347eab45dfc4b11106019%2Fautoshow-260208-07.jpg 1x,https://cst.brightspotcdn.com/dims4/default/3e380d6/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fca%2F0d%2Fd14d087347eab45dfc4b11106019%2Fautoshow-260208-07.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/fc5be1b/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fca%2F0d%2Fd14d087347eab45dfc4b11106019%2Fautoshow-260208-07.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Andrew Coldwater (left) and Marcel Sutkowski (right) stand at the Capture Company booth.\" srcset=\"https://cst.brightspotcdn.com/dims4/default/fc5be1b/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fca%2F0d%2Fd14d087347eab45dfc4b11106019%2Fautoshow-260208-07.jpg 1x,https://cst.brightspotcdn.com/dims4/default/c0050ba/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fca%2F0d%2Fd14d087347eab45dfc4b11106019%2Fautoshow-260208-07.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/fc5be1b/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fca%2F0d%2Fd14d087347eab45dfc4b11106019%2Fautoshow-260208-07.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Andrew Coldwater (left) and Marcel Sutkowski (right) stand beside a McLaren at the Capture Company booth.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Giacomo Cain/Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;That community also includes those barely out of kindergarten, said car detailer Andrew Coldwater, 20, of Shorewood, who cleaned up a McLaren 765LT for display at the show.&lt;/p&gt;&lt;p&gt;“There was a little kid, probably 6 years old, and he knew everything about the car — more stuff than I know,” said Coldwater, who owns Coldwater Car Care. “That's how I used to be as a little kid, coming to stuff like the auto show. To see that still going on is very cool. It’s the stuff that makes me really enjoy what I do.”&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-5e0000\" name=\"image-5e0000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/25bbba2/2147483647/strip/true/crop/5486x3079+0+289/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8e%2F90%2Fcb2bd4d64644ae8bf92e16356611%2Fautoshow-260208-11.jpg 1x,https://cst.brightspotcdn.com/dims4/default/c48b451/2147483647/strip/true/crop/5486x3079+0+289/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8e%2F90%2Fcb2bd4d64644ae8bf92e16356611%2Fautoshow-260208-11.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/550c600/2147483647/strip/true/crop/5486x3079+0+289/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8e%2F90%2Fcb2bd4d64644ae8bf92e16356611%2Fautoshow-260208-11.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Attendees roam the floor of the Chicago Auto Show at McCormick Place on Saturday, Feb. 7, 2026.\" srcset=\"https://cst.brightspotcdn.com/dims4/default/550c600/2147483647/strip/true/crop/5486x3079+0+289/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8e%2F90%2Fcb2bd4d64644ae8bf92e16356611%2Fautoshow-260208-11.jpg 1x,https://cst.brightspotcdn.com/dims4/default/8c83aa6/2147483647/strip/true/crop/5486x3079+0+289/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8e%2F90%2Fcb2bd4d64644ae8bf92e16356611%2Fautoshow-260208-11.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/550c600/2147483647/strip/true/crop/5486x3079+0+289/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8e%2F90%2Fcb2bd4d64644ae8bf92e16356611%2Fautoshow-260208-11.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Attendees roam the floor of the Chicago Auto Show, which runs through Feb. 16 at McCormick Place.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Giacomo Cain/Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Erica Thompson",
      "id": "https://chicago.suntimes.com/arts-and-culture/2026/02/07/chicago-auto-shows-chi-town-alley-car-culture",
      "tags": []
    },
    {
      "title": "Teams of lawyers put drivers back on the road by reinstating suspended licenses",
      "link": "https://chicago.suntimes.com/transportation/2026/02/07/drivers-license-reinstatement-expo-courts-transportation",
      "published": "2026-02-07T18:26:59.033-06:00",
      "published_parsed": "2026-02-08T00:26:59",
      "summary": "<img alt=\"Getting to work and getting her kids to school became difficult and expensive for healthcare worker Calanthea Caldwell, 36, whose driver's license was suspended 12 years ago. Thanks to the Driver’s License Reinstatement Expo, she'll soon have her license restored.\" src=\"https://cst.brightspotcdn.com/dims4/default/dc74fb0/2147483647/strip/true/crop/6000x4000+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fc0%2F33%2F0e1dbf7e48fabb9a3710038f9371%2Fdsc01149.JPG\" />\n        \n        \n            &lt;p&gt;A Cook County mother of five left Saturday’s Driver’s License Reinstatement Expo in tears after all charges against her were dismissed, ending a 12-year-long suspension of her driver’s license.&lt;/p&gt;&lt;p&gt;Calanthea Caldwell, 36, is an operating room technician at Rush University Medical Center. Her license was first suspended in 2014 when she got a ticket for driving without insurance. Since then, she's accumulated additional violations, including for failure to appear in court and other minor traffic tickets.&lt;/p&gt;&lt;p&gt;Without a valid license, Caldwell says she has been spending nearly $80 a day on Uber rides to get herself and her children to work and school.&lt;/p&gt;&lt;p&gt;“I’m crying tears of joy because I’ve waited years to get my license back,” Caldwell said. “I’m racking up more debt than I’m able to pay working one job.”&lt;/p&gt;&lt;p&gt;The Driver’s License Reinstatement Expo provides Cook County residents with free legal assistance to help restore suspended or revoked Illinois driver’s licenses. Saturday's event was hosted by the Pilsen Neighbors Community Council at Malcolm X College.&lt;/p&gt;&lt;p&gt;The event partners with the Illinois Secretary of State’s office, the Cook County public defender’s office, judges, and pro bono attorneys to create a one-stop shop for residents seeking relief. Nearly 500 people registered to attend, and there were many other walk-ins.&lt;/p&gt;&lt;p&gt;Expo founder Alex Garcia said the event is held annually during Black History Month and Hispanic Heritage Month to support Black and Brown communities that are disproportionately impacted by license suspensions.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-940000\" name=\"image-940000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/aa8a46c/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9b%2Fa9%2Fa837eee147ca9cb950d4b2744510%2Fdsc01136.JPG 1x,https://cst.brightspotcdn.com/dims4/default/74a9d7b/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9b%2Fa9%2Fa837eee147ca9cb950d4b2744510%2Fdsc01136.JPG 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/8e52a5b/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9b%2Fa9%2Fa837eee147ca9cb950d4b2744510%2Fdsc01136.JPG\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Alex Garcia, founder of the Driver’s License Reinstatement Expo, said the continued need for the event highlights how license suspensions disproportionately impact people of color. “We are glad to continue doing these expos,” Garcia said, “but we hope elected officials change policies so there won’t be a need to host them in the future.” Somer Van Benton/WBEZ\" srcset=\"https://cst.brightspotcdn.com/dims4/default/8e52a5b/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9b%2Fa9%2Fa837eee147ca9cb950d4b2744510%2Fdsc01136.JPG 1x,https://cst.brightspotcdn.com/dims4/default/6646d2e/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9b%2Fa9%2Fa837eee147ca9cb950d4b2744510%2Fdsc01136.JPG 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/8e52a5b/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9b%2Fa9%2Fa837eee147ca9cb950d4b2744510%2Fdsc01136.JPG\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Alex Garcia, founder of the Driver’s License Reinstatement Expo, says Pilsen Neighbors Community Council has been advocating for local and state policy changes to prevent certain moving violations from resulting in licenses being suspended or revoked.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Somer Van Benton/WBEZ&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;“Public transportation is an option. Ride-sharing is another option, but driving is probably the easiest option,” Garcia said.&lt;/p&gt;&lt;p&gt;For people like Caldwell, however, public transportation can be time-consuming and ride-sharing expensive.&lt;/p&gt;&lt;p&gt;Garcia said the Pilsen Neighbors Community Council has also been advocating for local and state policy changes to prevent certain moving violations from resulting in licenses being suspended or revoked.&lt;/p&gt;&lt;p&gt;“Anybody can be stopped for a traffic ticket, and anyone can be impacted by the system,” Deputy Public Defender Parle Roe-Taylor said.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-670000\" name=\"image-670000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/49c0066/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2F8b%2F279519124157af6fa9fd73223234%2Fdsc01139.JPG 1x,https://cst.brightspotcdn.com/dims4/default/0216208/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2F8b%2F279519124157af6fa9fd73223234%2Fdsc01139.JPG 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/9221d4f/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2F8b%2F279519124157af6fa9fd73223234%2Fdsc01139.JPG\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Deputy Public Defender Parle Roe-Taylor said people of color are more likely to be impacted by driver’s license suspensions and revocations. Holding the expo during Black History Month and Hispanic Heritage Month, she said, is a way to support and celebrate the entire community. Somer Van Benton/WBEZ\" srcset=\"https://cst.brightspotcdn.com/dims4/default/9221d4f/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2F8b%2F279519124157af6fa9fd73223234%2Fdsc01139.JPG 1x,https://cst.brightspotcdn.com/dims4/default/1164c43/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2F8b%2F279519124157af6fa9fd73223234%2Fdsc01139.JPG 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/9221d4f/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2F8b%2F279519124157af6fa9fd73223234%2Fdsc01139.JPG\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Deputy Public Defender Parle Roe-Taylor has helped recruit lawyers and judges to volunteer with the Driver’s License Reinstatement Expo.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Somer Van Benton/WBEZ&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;Roe-Taylor has volunteered with the expo since its launch in 2019 and helped Garcia recruit judges and attorneys. &lt;/p&gt;&lt;p&gt;“Everyone is coming together so that we can complete our mission to get people in the position to drive — legally, properly and under all the rules of the road,” Roe-Taylor said.&lt;/p&gt;&lt;p&gt;Attorney Shay Meredith, who works with the public defender’s office, also volunteered at the event.&lt;/p&gt;&lt;p&gt;“It’s really nice seeing people’s faces light up when they realize, ‘Oh my gosh, I can actually get my license,’” Meredith said.&lt;/p&gt;&lt;p&gt;Meredith specializes in cases involving driving with a suspended or revoked license.&lt;/p&gt;&lt;p&gt;“The vast majority of reasons I see people’s licenses suspended are an inability to pay fines or an inability to come to court because they have family obligations,” she said. “It’s not because we have a bunch of dangerous criminals on the road causing crashes left and right.”&lt;/p&gt;&lt;p&gt;Jamari Cotton, 22, also had his license reinstated during the expo. His license had been suspended after he accumulated too many traffic violations before turning 21. With the help of his pro bono attorney, Martha Soto, Cotton had his cases dismissed because none were DUI-related.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-9a0000\" name=\"image-9a0000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/afc872d/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F77%2F2d4835e84c36888a04904d229f3d%2Fdsc01151.JPG 1x,https://cst.brightspotcdn.com/dims4/default/b664575/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F77%2F2d4835e84c36888a04904d229f3d%2Fdsc01151.JPG 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/71fc36a/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F77%2F2d4835e84c36888a04904d229f3d%2Fdsc01151.JPG\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Jamari Cotton, 22, had his license suspended after accumulating multiple traffic violations before turning 21. Following the expo, all of his 2025 cases were dismissed. Somer Van Benton/WBEZ\" srcset=\"https://cst.brightspotcdn.com/dims4/default/71fc36a/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F77%2F2d4835e84c36888a04904d229f3d%2Fdsc01151.JPG 1x,https://cst.brightspotcdn.com/dims4/default/9414d4b/2147483647/strip/true/crop/6000x3367+0+316/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F77%2F2d4835e84c36888a04904d229f3d%2Fdsc01151.JPG 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/71fc36a/2147483647/strip/true/crop/6000x3367+0+316/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F77%2F2d4835e84c36888a04904d229f3d%2Fdsc01151.JPG\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Jamari Cotton, 22, had his license suspended after accumulating multiple traffic violations before he turned 21. He walked out of Saturday’s expo with all his cases cleared. &lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Somer Van Benton/WBEZ&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;“I’ve just been granted a privilege again,” Cotton said.&lt;/p&gt;&lt;p&gt;Cotton is a sophomore studying electrical engineering at Western Illinois University, located nearly 240 miles southwest of Chicago in Macomb.&lt;/p&gt;&lt;p&gt;He received two violations — one for disregarding a stop sign and another for a headlight issue — both in rural towns outside Chicago.&lt;/p&gt;&lt;div class=\"RelatedList Enhancement\" data-module data-align-center&gt;\n    \n     &lt;div class=\"RelatedList-title\"&gt;Related&lt;/div&gt;\n    \n\n    \n        &lt;ul class=\"RelatedList-items\"&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/consumer-affairs/2025/11/18/digital-drivers-license-id-illinois\"   &gt;Digital driver’s licenses, IDs available to Illinois residents starting Wednesday&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/columnists/2025/04/15/real-id-regulations-secretary-of-state-alexi-giannoulias\"   &gt;Farcical Real ID regulations swamp Illinois DMV centers&lt;/a&gt;\n                &lt;/li&gt;\n            \n        &lt;/ul&gt;\n    \n&lt;/div&gt;\n&lt;p&gt;“In smaller counties, with local officers, I had a headlight out, so that gives them a reason to pull me over,” Cotton said. “The whole situation could just escalate from there.”&lt;/p&gt;&lt;p&gt;Both Cotton and Caldwell had their charges dismissed in full. Each will still need to complete a driving test and re-register their licenses before legally returning to the road.&lt;/p&gt;",
      "author": "Somer Van Benton | WBEZ",
      "id": "https://chicago.suntimes.com/transportation/2026/02/07/drivers-license-reinstatement-expo-courts-transportation",
      "tags": []
    },
    {
      "title": "Horoscope for Sunday, February 08, 2026",
      "link": "https://chicago.suntimes.com/horoscopes/2026/02/08/horoscopes-today-sunday-february-08-2026",
      "published": "2026-02-08T00:01:00-06:00",
      "published_parsed": "2026-02-08T06:01:00",
      "summary": "<img alt=\"\" src=\"https://cst.brightspotcdn.com/dims4/default/db31843/2147483647/strip/true/crop/870x630+0+0/resize/840x608!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fac%2Ffd%2F790f04b15195427014757adc0272%2Fgeorgia-nicols.jpg\" />\n        \n        \n            &lt;h2&gt;Moon Alert&lt;/h2&gt;\n\n&lt;p&gt;There are no restrictions to shopping or important decisions today. The moon is in Scorpio.&lt;/p&gt;&lt;h2&gt;Aries (March 21-April 19)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-4d0000\" name=\"html-embed-module-4d0000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;An &lt;b&gt;average&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nSomething unexpected might happen with a friend today. They might say or do something that catches you off guard. Or perhaps you will meet someone different and unusual. You might have a clash of opinions with someone about shared property or shared funds.&lt;/p&gt;&lt;h2&gt;Taurus (April 20-May 20)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nSteer clear of arguments with parents, bosses, the police, and authority figures because it won't go well. Conflict might arise. However, someone in authority might also help you in an unexpected way. Who knows? It's a tricky day. Keep your head down and your powder dry.&lt;/p&gt;&lt;h2&gt;Gemini (May 21-June 20)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-4d0000\" name=\"html-embed-module-4d0000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;An &lt;b&gt;average&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nTravel plans might suddenly change today. They could be delayed or canceled, or alternatively, you might have to travel when you did not expect to do so. Avoid controversial subjects because they could quickly turn into arguments. Tread carefully.&lt;/p&gt;&lt;h2&gt;Cancer (June 21-July 22)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt; Keep your pockets open because unexpected gifts, goodies and favors from others might come your way. However, keep an eye on your banking and your assets because something unexpected could impact them. Avoid money quarrels with romantic partners — as well as your kids.&lt;/p&gt;&lt;h2&gt;Leo (July 23-Aug. 22)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt; Today is unpredictable and a bit of a mishmash because relations with those who are closest might suddenly change. You might be surprised. This surprise might be pleasing — or not. Try to avoid arguments and disputes with spouses or family members. Be diplomatic.&lt;/p&gt;&lt;h2&gt;Virgo (Aug. 23-Sept. 22)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nYour work routine might suddenly change today. Staff shortages, power outages, and computer problems are just some reasons things might go sideways. Avoid work-related arguments or those related to a pet or even your health. Stay chill.&lt;/p&gt;&lt;h2&gt;Libra (Sept. 23-Oct. 22)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-4d0000\" name=\"html-embed-module-4d0000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;An &lt;b&gt;average&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nThis is a dicey day dealing with your kids. Parents especially will have to be patient and diplomatic. Meanwhile, social occasions might suddenly change. They could be canceled or delayed, or you might receive a surprising invitation. It could be anything. Stay flexible.&lt;/p&gt;&lt;h2&gt;Scorpio (Oct. 23-Nov. 21)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt; Something unexpected might impact your home and family today. It could be pleasant, or it could be troublesome. Today the moon in your sign is at odds with fiery Mars, hinting at domestic quarrels and problems. Don’t say anything you will later regret. Practice patience.&lt;/p&gt;&lt;h2&gt;Sagittarius (Nov. 22-Dec. 21)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nThis is a mildly accident-prone day for you because a distraction could lead to an argument, hurt feelings or something unusual happening. Stay focused, and you can avoid an accident. Nevertheless, new faces and new places might excite you.&lt;/p&gt;&lt;h2&gt;Capricorn (Dec. 22-Jan. 19)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-4d0000\" name=\"html-embed-module-4d0000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;An &lt;b&gt;average&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nKeep an eye on your money and possessions today to avoid loss, theft or damage. Meanwhile, a little windfall might come your way. It could be a gift, a raise or a favor that financially (or practically) helps you in some way. Avoid arguments with a friend about money or possessions.&lt;/p&gt;&lt;h2&gt;Aquarius (Jan. 20-Feb. 18)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-290000\" name=\"html-embed-module-290000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;A &lt;b&gt;so-so&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nPeople notice you today, which is why you want to keep your cool and avoid a public argument — unless this is what you want. Ironically, something unexpected will help you. It might be the purchase of clothing that makes you feel more attractive. Perhaps you will create a more positive image. Be alert.&lt;/p&gt;&lt;h2&gt;Pisces (Feb. 19-March 20)&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n\n&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-4d0000\" name=\"html-embed-module-4d0000\"&gt;&lt;/a&gt;&lt;div class=\"HoroscopeStarbox HoroscopeStarbox_five\"&gt;\n    &lt;div class=\"HoroscopeStarbox_container\"&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n        &lt;svg class=\"HoroscopeStar\"&gt;&lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;&lt;/svg&gt;\n    &lt;/div&gt;\n    \n    &lt;div class=\"HoroscopeStarbox_description\"&gt;\n        &lt;p&gt;An &lt;b&gt;average&lt;/b&gt; day&lt;/p&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;style&gt;\n    .HoroscopeStarbox {\n        background: #f8f8f8;\n        display: flex;\n        align-items: center;\n    }\n    \n    .HoroscopeStarbox_container {\n        display: grid;\n        grid-gap: 5px;\n        grid-template-columns: 1fr 1fr 1fr 1fr 1fr;\n        padding: 20px;\n        width: 40%;\n        min-width: 160px;\n        max-width: 200px;\n    }\n    \n    .HoroscopeStarbox_description {\n        padding: 20px;\n        font-family: var(--font-1);\n    \tfont-size: var(--body-2);\n    }\n    \n    .HoroscopeStarbox_container svg {\n        object-fit: cover;\n        aspect-ratio: 1 / 1;\n        width: 100%;\n    }\n&lt;/style&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;\nThis is a restless day. In one way, something unexpected might please you. However, in another way, you might be doing a slow boil because you're angry or resentful about something but feel you can't speak up. You are wise to wait for another day. But it's OK to speak your truth in a calm way when you're ready.&lt;/p&gt;&lt;h2&gt;If today is your birthday&lt;/h2&gt;&lt;p&gt;Novelist and lawyer John Grisham (1955) shares your birthday today. You're intuitive, personable and creative. Many of you have a flair for technology or musical talent. This is a slower-paced year. Take time to rest and rejuvenate your energies and outlook. Focus on partnerships and spend time with people who are kind, helpful and supportive.&lt;/p&gt;",
      "author": "Georgia Nicols",
      "id": "https://chicago.suntimes.com/horoscopes/2026/02/08/horoscopes-today-sunday-february-08-2026",
      "tags": []
    },
    {
      "title": "'Joke' is on the new-look Bulls roster in what was great night to tank",
      "link": "https://chicago.suntimes.com/bulls/2026/02/07/joke-on-new-look-bulls-roster-great-night-to-tank",
      "published": "2026-02-07T22:05:21.727-06:00",
      "published_parsed": "2026-02-08T04:05:21",
      "summary": "<img alt=\"New Bull Nick Richards had a strong showing in his debut, but the reality of the situation presented itself in the fourth when there was no answer for Nikola Jokic and the Nuggets.\" src=\"https://cst.brightspotcdn.com/dims4/default/2765efe/2147483647/strip/true/crop/7908x5272+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F56%2F71%2Fe66fa8b94c96bf7a394a06b90cea%2Fnuggets-bulls-basketball.jpg\" />\n        \n        \n            &lt;p&gt;This is what &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bulls\"  target=\"_blank\"   &gt;Bulls&lt;/a&gt; basketball should look like the rest of the season.&lt;/p&gt;&lt;p&gt;They should put in three quarters of competitive, hard-nosed play, have seven players in double figures, then get overwhelmed in the fourth quarter in a dash for more draft-lottery balls.&lt;/p&gt;&lt;p&gt;With &lt;b&gt;Nikola Jokic&lt;/b&gt; passing &lt;b&gt;Oscar Robertson&lt;/b&gt; for the second-most triple-doubles in NBA history (182), the Nuggets helped the Bulls out in the soft-tank department, outscoring them by 23 in the fourth to run away with a 136-120 victory Saturday at the United Center.&lt;/p&gt;&lt;p&gt;Jokic had 22 points, 17 assists and 14 rebounds.&lt;/p&gt;&lt;p&gt;“I love watching [Jokic] play,” Bulls coach &lt;b&gt;Billy Donovan&lt;/b&gt; said. “One, he impacts the game in so many ways. He does it with his passing, his screening, just a level of unselfishness, and the way he plays the game is impressive.”&lt;/p&gt;&lt;p&gt;Donovan and his new-look squad got to see that up close, especially in the fourth quarter. Jokic was a plus-19 in that quarter alone.&lt;/p&gt;&lt;p&gt;As for the new Bulls, &lt;b&gt;Collin Sexton&lt;/b&gt; had 17 points, &lt;b&gt;Nick Richards&lt;/b&gt; and &lt;b&gt;Anfernee Simons&lt;/b&gt; each had 15 points, &lt;b&gt;Guerschon Yabusele&lt;/b&gt; scored 12, &lt;b&gt;Jaden Ivey&lt;/b&gt; had 10 points and &lt;b&gt;Rob Dillingham&lt;/b&gt; scored nine.&lt;/p&gt;&lt;p&gt;&lt;b&gt;Matas Buzelis&lt;/b&gt; led the Bulls with 21 points and grabbed eight rebounds.&lt;/p&gt;&lt;p&gt;“The defense was not good [in the fourth quarter],” Donovan said. “We’re going to make some mistakes. The guys are all playing together; guys are forgetting plays; the spacing may not [be there]. It’s going to happen, but we’ve got to get much, much better defensively.”&lt;/p&gt;&lt;p&gt;&lt;b&gt;Ivey league&lt;/b&gt;&lt;/p&gt;&lt;p&gt;Ivey said it was quite some time since he put in a 33-minute shift, which he did in his Bulls debut in Toronto on Thursday.&lt;/p&gt;&lt;p&gt;It actually took place Dec. 26, 2024, while he was still a regular in the Pistons’ starting lineup.&lt;/p&gt;&lt;p&gt;No wonder Ivey was admittedly feeling it.&lt;/p&gt;&lt;p&gt;“Obviously, it’s taxing on my body, but, shoot, so is basketball in general,” Ivey said. “I checked the stat sheet as far as my minutes, and 33 minutes was probably the longest I’ve played in a while.”&lt;/p&gt;&lt;p&gt;When asked about his approach in figuring out how to play with all of his new teammates, he said it feels like a pickup game at the local gym.&lt;/p&gt;&lt;p&gt;“I mean, yeah, you ask anybody that gets traded, nobody just comes in and, ‘Man, we got it down pat,’ ’’ Ivey said. “You gotta kind of figure it out, and it takes time.”&lt;/p&gt;&lt;p&gt;&lt;b&gt;A different view&lt;/b&gt;&lt;/p&gt;&lt;p&gt;Bulls executive vice president &lt;b&gt;Arturas Karnisovas&lt;/b&gt; admittedly took a lot out of the 15-5 run at the end of the 2024-25 regular season, but he might’ve put too much stock in it.&lt;/p&gt;&lt;p&gt;Donovan was asked about the approach to the rest of this season and made it clear that he looks at things differently.&lt;/p&gt;&lt;p&gt;“The thing that stood out to me more than anything else was the Miami [play-in] game,” Donovan said. “The 15-5, because it was the end of the year, was such a mixed bag of teams.&lt;/p&gt;&lt;p&gt;‘‘When there was a meaningful game, like a Game 7, so to speak, we got really dominated in that game.&lt;/p&gt;&lt;p&gt;“I looked at it from the lens of we’ve got a lot of growth yet to get better and a lot of that was, ‘Hey, we’ve got to get more physical.’ ’’&lt;/p&gt;",
      "author": "Joe Cowley",
      "id": "https://chicago.suntimes.com/bulls/2026/02/07/joke-on-new-look-bulls-roster-great-night-to-tank",
      "tags": []
    },
    {
      "title": "Super Bowl LX preview: Seahawks, Patriots carry weight of franchise legacies in very different ways",
      "link": "https://chicago.suntimes.com/bears/2026/02/08/super-bowl-lx-preview-seahawks-patriots-carry-weight-of-franchise-legacies-in-very-different-ways",
      "published": "2026-02-08T06:00:00-06:00",
      "published_parsed": "2026-02-08T12:00:00",
      "summary": "<img alt=\"New Englad Patriots quarterback Drake Maye, left, and Seattle Seahawks quarterback Sam Darnold, right, smile on stage with the Lombardi Trophy during the NFL Super Bowl Opening Night, Monday, Feb. 2, 2026, in San Jose, Calif., ahead of the Super Bowl 60 football game between the New England Patriots and the Seattle Seahawks. (Carlos Avila Gonzalez/San Francisco Chronicle via AP)\" src=\"https://cst.brightspotcdn.com/dims4/default/dcc3d7d/2147483647/strip/true/crop/6500x4265+0+0/resize/840x551!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff0%2F24%2F8f9a4cad4bfdb1077f131787f1a4%2Fap26034226663589.jpg\" />\n        \n        \n            &lt;p&gt;SANTA CLARA, Calif. — It has been more than a decade since the stunning end to the Patriots’ Super Bowl XLIX win over the Seahawks when Seattle fatefully opted against giving the ball to Marshawn Lynch at the goal line and instead lost on an interception, and no one who played in that game is still around for either team.&lt;/p&gt;&lt;p&gt;But it’s still a rematch Sunday in Super Bowl LX as both teams compete not only against each other, but their respective franchises’ legacies.&lt;/p&gt;&lt;p&gt;With their tremendous defense and ballhawking secondary, the Seahawks seek to prove the sequel to the Legion of Boom era is as good as the original. The Patriots, meanwhile, want to finally move forward from the departures of coach Bill Belichick and quarterback Tom Brady as Mike Vrabel and &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears/2026/01/25/bears-patriots-seahawks-super-bowl-drake-maye-caleb-williams-quarterback-draft-class-2024-sunday-nfl-afc-nfc-championships\"   &gt;Drake Maye&lt;/a&gt; step into the spotlight.&lt;/p&gt;&lt;p&gt;Brady leaving in 2020 was unpleasant for all parties and sent the Patriots spiraling. Belichick managed one winning season without him and was gone four years later. Successor Jerod Mayo couldn’t measure up, and neither could 2021 first-round pick Mac Jones at quarterback.&lt;/p&gt;&lt;p&gt;After back-to-back 4-13 seasons, the Patriots reached into their past to find their future. Vrabel, a three-time champion linebacker from the Belichick years, was exactly what Maye, and the team at large, needed.&lt;/p&gt;&lt;p&gt;Super Bowl week has been a clear demarcation between where the Patriots were and where they’re headed. Not only are they playing for what would be a record-setting seventh championship, but Vrabel was awarded Coach of the Year and Maye finished a very close second for MVP.&lt;/p&gt;&lt;p&gt;That combination was essential in the Patriots finishing top five in scoring offense and defense for first time since 2017.&lt;/p&gt;&lt;p&gt;With the Seahawks it wasn’t so much a problem with coach Pete Carroll’s approach, but rather that they needed a fresh voice after three middling seasons and with Carroll in his 70s. Coach Mike McDonald credited Carroll for laying the foundation for what he’s done the last two seasons, and like Carroll, he’s a defensive minded coach.&lt;/p&gt;&lt;p&gt;The Seahawks have no desire to push Legion of Boom deeper into their past. It’s more so a standard they’re trying to reach. The stars of that group still come around quite a bit, and Seahawks safety Julian Love said the defense talks with former four-time Pro Bowl safety Kam Chancellor weekly.&lt;/p&gt;&lt;p&gt;“They give us our flowers and vice versa,” safety Coby Bryant said. “We appreciate those guys coming around. They’ve been a huge help since I stepped into the league.&lt;/p&gt;&lt;p&gt;“I modeled my game after a lot of those guys growing up. They always flew around and made plays, and that was something I saw myself doing.”&lt;/p&gt;&lt;p&gt;They’ve looked like the new version of Legion of Boom, and just like that group, allowed the fewest points in the league this season.&lt;/p&gt;&lt;p&gt;Legacies have raised the stakes for both teams as the Seahawks try to live up to theirs and the Patriots are out to write a new one.&lt;/p&gt;&lt;h3&gt;When the Seahawks have the ball&lt;/h3&gt;&lt;p&gt;It’s time to &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears/2026/02/06/ridiculed-and-doubted-for-years-seahawks-qb-sam-darnold-declines-to-gloat-at-super-bowl-lx\"   &gt;take quarterback Sam Darnold seriously&lt;/a&gt;. He deserved that respect last season with the Vikings, really, but now it can’t even be argued.&lt;/p&gt;&lt;p&gt;After six seasons adrift, mainly with the lowly Jets and Panthers, he has gone 30-7 as a starter the last two seasons, including the playoffs. In that span, he posted a 101.1 passer rating, threw 65 touchdown passes and 27 interceptions and averaged 245.5 yards per game.&lt;/p&gt;&lt;p&gt;That’s not a “system quarterback” or someone quietly riding a great defense to victories. That’s a winner. Maybe the Jets and the Panthers were the problem.&lt;/p&gt;&lt;p&gt;Darnold followed his excellent regular season with two monster playoff games as the Sea-hawks scored a total of 72 points to beat the Rams and 49ers. He’s as much the reason they’re in the Super Bowl as anyone else on the roster.&lt;/p&gt;&lt;p&gt;“He’s been everything you would want in a quarterback,” All-Pro wide receiver Jaxon Smith-Njigba said. “We all love Sam and believe in him.”&lt;/p&gt;&lt;p&gt;The Patriots were eighth in total defense this season, but they faced a lot of bad quarterbacks and still allowed the 12th-highest passer rating in the regular season. They also had the ninth-lowest pressure rate, and Darnold is protected by a top-10 offensive line, meaning he’ll have time to find weapons such as Smith-Njigba, Cooper Kupp and AJ Barner.&lt;/p&gt;&lt;h3&gt;When the Patriots have the ball&lt;/h3&gt;&lt;p&gt;Quarterback Drake Maye had an MVP-caliber season, but the Patriots are unlikely to win without their ground game rolling. That starts with rookie running back TreVeyon Henderson.&lt;/p&gt;&lt;p&gt;Henderson went 38th overall in the draft last year, 32 spots behind coveted star Ashton Jeanty, but had just as good of a rookie season as Jeanty. Henderson finished second in the draft class to Jeanty’s 975 yards rushing with 911, though his 5.1 yards per carry blew away Jeanty’s 3.7, and led it with nine touchdown runs.&lt;/p&gt;&lt;p&gt;The Bears had their eyes on him in the draft but were sitting 39th. When the Patriots picked Henderson, the Bears picked wide receiver Luther Burden, and it worked out for all parties.&lt;/p&gt;&lt;p&gt;Henderson was mostly a non-factor, though, in the Patriots’ win over the Broncos in the AFC Championship Game. Weather played a big role in the game as heavy snow made everything difficult, but the Patriots managed just 10 points and Henderson ran three times for five yards.&lt;/p&gt;&lt;p&gt;They got far more production from Rhamondre Stevenson with 71 yards on 25 carries, and they’ll need both of them to step up if they’re going to make headway against a Seahawks defense that ranked third against the run in the regular season and shut down the Rams’ rushing attack in the NFC Championship Game.&lt;/p&gt;&lt;p&gt;Henderson called this the longest season of his life — he’s about to play his 21st game — and fatigue could be hitting him. He was under four yards per carry in each of his last three games and totaled just 195 yards over his last six.&lt;/p&gt;",
      "author": "Jason Lieser",
      "id": "https://chicago.suntimes.com/bears/2026/02/08/super-bowl-lx-preview-seahawks-patriots-carry-weight-of-franchise-legacies-in-very-different-ways",
      "tags": []
    },
    {
      "title": "Dear Abby: Spouse of serial cheater is ready to even the score",
      "link": "https://chicago.suntimes.com/dear-abby/2026/02/08/dearabby-today-dear-abby-spouse-of-serial-cheater-is-ready-to-even-the-score",
      "published": "2026-02-08T06:00:00-06:00",
      "published_parsed": "2026-02-08T12:00:00",
      "summary": "<img alt=\"\" src=\"https://cst.brightspotcdn.com/dims4/default/b8177db/2147483647/strip/true/crop/948x630+0+0/resize/840x558!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F58%2Fd7%2Fbb582a729d323e1398afcbc89478%2Fdear-abby-12880069-e1420416724734-532.jpg\" />\n        \n        \n            &lt;p&gt;&lt;b&gt;DEAR ABBY:&lt;/b&gt; My wife and I are approaching our 40th anniversary. Friends and family have already begun to mention the upcoming milestone. While I politely acknowledge the event, I hide my indifference. You see, my wife has always been a serial cheater. It's a secret I have kept from everyone, especially our children.&lt;/p&gt;&lt;p&gt;Because she has always been a wonderful mother, I would never do anything to tarnish their love and appreciation of her. The children are a large part of the reason I have remained married. Aside from her betrayal, she has been a good wife and companion, and I still love her.&lt;/p&gt;&lt;p&gt;During her affairs, I fought depression by submerging myself in work and crying when alone. Our children are grown and on their own now. We have a beautiful grandson. We both retired a couple of years ago, and that is when the reality of the past 40 years hit me. I no longer have the crutch of work to help me through.&lt;/p&gt;&lt;p&gt;Our marriage has been sexless since she went through menopause 15 years ago. I have been loyal to her all these years, but I still desire intimacy. I have a few female friends who, in the past, have shown an interest in more intimate relationships. Would it be wrong to rekindle and move forward with an old friend? I have no intention of leaving my wife, but I am so in need of something more. — &lt;i&gt;FORTY YEARS A FOOL&lt;/i&gt;&lt;/p&gt;&lt;p&gt;&lt;b&gt;DEAR 'FOOL':&lt;/b&gt; Have you actually TALKED to your wife (whom you love) about this? Many postmenopausal women whose libidos have declined still enjoy sex. This is a subject she should have discussed with her gynecologist 15 years ago because this is not an insurmountable problem. If she refuses, you would be within your rights to tell her you want the same dispensation you have given her for 40 years of infidelity, because you still need and desire intimacy. Her response will tell you everything you need to know.&lt;/p&gt;&lt;p&gt;&lt;b&gt;DEAR ABBY:&lt;/b&gt; I have been eating dessert on days I have deemed \"dessert-free.\" I get to have dessert on Monday, Wednesday and Friday. Can you please help me to stop my struggle on the days when I don't get dessert? — &lt;i&gt;CRAVING IT IN WASHINGTON&lt;/i&gt;&lt;/p&gt;&lt;p&gt;&lt;b&gt;DEAR CRAVING IT:&lt;/b&gt; I understand (only too well!) the mindset that a meal isn't complete unless there's something sweet at the end of the main course.&lt;/p&gt;&lt;p&gt;Years ago, a psychologist friend shared with me that she resolved her craving for something sweet by carrying a small bag containing a ginger snap cookie in her purse when she went to restaurants. When she was finished with her meal, she took the bag out of her purse and ate HALF of one. She said it satisfied her craving without sabotaging her diet. Try it. However, if it doesn't work for you, consider substituting a piece of fresh fruit for the cookie.&lt;/p&gt;&lt;p&gt;&lt;i&gt;Dear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069.&lt;/i&gt;&lt;/p&gt;&lt;p&gt;For everything you need to know about wedding planning, order \"How to Have a Lovely Wedding.\" Send your name and mailing address, plus check or money order for $8 (U.S. funds) to: Dear Abby, Wedding Booklet, P.O. Box 446, Kings Mills, OH 45034-0446. (Shipping and handling are included in the price.)&lt;/p&gt;",
      "author": "Abigail Van Buren",
      "id": "https://chicago.suntimes.com/dear-abby/2026/02/08/dearabby-today-dear-abby-spouse-of-serial-cheater-is-ready-to-even-the-score",
      "tags": []
    },
    {
      "title": "Chicago police investigating death of 10-year-old girl in Kenwood",
      "link": "https://chicago.suntimes.com/crime/2026/02/08/chicago-police-death-10-year-old-girl-kenwood",
      "published": "2026-02-08T08:10:53.694-06:00",
      "published_parsed": "2026-02-08T14:10:53",
      "summary": "<img alt=\"Chicago police are investigating the death of a 10-year-old girl in Kenwood.\" src=\"https://cst.brightspotcdn.com/dims4/default/94cbed9/2147483647/strip/true/crop/6123x4082+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F06%2F2f%2F1a6ee58db01b17ddff3f51966b35%2Fmerlin-107512066.jpg\" />\n        \n        \n            &lt;p&gt;Chicago police are investigating the death of a 10-year-old girl in Kenwood.&lt;/p&gt;&lt;p&gt;The girl, Shadaiyah O'Hara, was found unresponsive around 10 p.m. Saturday in the 4400 block of South Drexel Avenue, according to the Cook County medical examiner's office and police.&lt;/p&gt;&lt;p&gt;Officers responded to assist Chicago firefighters, who treated Shadaiyah and took her to Comer Children’s Hospital where she was pronounced dead. Her cause of death is under investigation, police said.&lt;/p&gt;",
      "author": "Sun-Times Wire",
      "id": "https://chicago.suntimes.com/crime/2026/02/08/chicago-police-death-10-year-old-girl-kenwood",
      "tags": []
    },
    {
      "title": "Analyzing the Blackhawks' season so far: Nine trends stand out",
      "link": "https://chicago.suntimes.com/blackhawks/2026/02/08/blackhawks-season-trends-connor-bedard-frank-nazar-spencer-knight",
      "published": "2026-02-08T06:30:00-06:00",
      "published_parsed": "2026-02-08T12:30:00",
      "summary": "<img alt=\"Louis Crevier's growth is one unexpectedly encouraging part of the Blackhawks' season so far.\" src=\"https://cst.brightspotcdn.com/dims4/default/e63dafd/2147483647/strip/true/crop/8640x5760+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fd3%2F02%2F6acb91bf461291bdeeb6be72e18d%2Fcrevier-1.jpg\" />\n        \n        \n            &lt;p&gt;The &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks\"  target=\"_blank\"   &gt;Blackhawks&lt;/a&gt; have already passed the two-thirds mark of their 2025-26 season, and it has been a much more interesting and eventful season than the past few.&lt;/p&gt;&lt;p&gt;At 22-26-9, they're on pace to finish with 76 points, which would represent a sizable improvement upon their 61 and 52 points each of the last two seasons. That's in spite of losing nine of their last 12 entering the now-ongoing Olympic break.&lt;/p&gt;&lt;p&gt;While players relax on beaches across the continent and await the season's resumption Feb. 26, here's an examination of the Hawks' most encouraging and discouraging&amp;nbsp;trends so far.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Encouraging: Bedard’s breakout&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;Connor Bedard's injury and somewhat slow post-injury return to top form has distracted fans from the fact Bedard has still taken a huge step forward this season.&lt;/p&gt;&lt;p&gt;With 53 points in 44 games, he's averaging 1.2 points per game, up from 0.9 and 0.82 in his first two seasons. If not for his injury, he would be on pace to reach nearly 100 points. His defensive work ethic has also increased substantially.&lt;/p&gt;&lt;p&gt;There's no doubt Bedard has &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2025/10/29/connor-bedard-blackhawks-voice-honest-kings-boring-macklin-celebrini\"  target=\"_blank\"   &gt;become&lt;/a&gt; the superstar everyone expected him to become when the Hawks drafted him — even if San Jose's Macklin Celebrini's even faster road to superstardom has also distracted fans from the impressiveness of that fact.&lt;/p&gt;&lt;p&gt;The Hawks don't have to worry about finding their next franchise cornerstone —&amp;nbsp;because they have that guy already. That's something very few other NHL franchises can claim. &lt;/p&gt;&lt;p&gt;The price tag of Bedard's new contract this summer will be interesting, but the Hawks can easily afford any number. Locking him up long-term is a matter of when, not if.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;&lt;div class=\"Enhancement-item\"&gt;\n            &lt;div class=\"ExternalContent-wrapper\" &gt;\n                &lt;div class=\"TweetUrl\"&gt;\n    &lt;blockquote class=\"twitter-tweet\"&gt;&lt;p lang=\"en\" dir=\"ltr\"&gt;Three-game goal streak for Connor Bedard, and five points in his last 4 games:&lt;a href=\"https://t.co/DaBRyXrCgG\"&gt;pic.twitter.com/DaBRyXrCgG&lt;/a&gt;&lt;/p&gt;&amp;mdash; Ben Pope (@BenPopeCST) &lt;a href=\"https://twitter.com/BenPopeCST/status/2018502650140959137?ref_src=twsrc%5Etfw\"&gt;February 3, 2026&lt;/a&gt;&lt;/blockquote&gt;\n&lt;script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"&gt;&lt;/script&gt;\n\n\n&lt;/div&gt;\n\n            &lt;/div&gt;\n        &lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Discouraging: No star ‘D’ yet&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;The Hawks hope either Artyom Levshunov or Sam Rinzel will eventually emerge as a No. 1 defenseman. Neither has done so yet, though, even though they still have plenty of time.&lt;/p&gt;&lt;p&gt;Levshunov enjoyed the best stretch of his career around New Year's, but then his game fell off a cliff, leading to his removal from the lineup for a &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2026/01/30/blackhawks-artyom-levshunov-reset-break-foundational-skills-jeff-blashill\"  target=\"_blank\"   &gt;fundamental reset&lt;/a&gt;. Rinzel hasn't replicated his excellence from last spring, although he has &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/2026/02/03/blackhawks-sam-rinzel-brainpower-weight-strength-zach-werenski-artyom-levshunov\"  target=\"_blank\"   &gt;looked better&lt;/a&gt; (in a small sample) since his recent call-up.&lt;/p&gt;&lt;p&gt;In the AHL, too, Kevin Korchinski hasn't demonstrated he's made a substantial leap forward in terms of on-ice ability, even though his mindset has &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2025/11/19/blackhawks-prospect-kevin-korchinski-rockford-icehogs-development-ahl-nhl\"  target=\"_blank\"   &gt;matured&lt;/a&gt;. That means none of the Hawks' top three defensive prospects are exceeding expectations this season.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Encouraging: Crevier, Kaiser’s growth&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;On the other hand, Louis Crevier and Wyatt Kaiser have evolved from depth defensemen of debatable relevance within the rebuild into trustworthy top-four defensemen who deserve to stick around long-term.&lt;/p&gt;&lt;p&gt;Kaiser's quick brain and quick feet have earned &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2025/11/05/blackhawks-wyatt-kaiser-defensive-stalwart-duncan-keith-nhl\"  target=\"_blank\"   &gt;comparisons&lt;/a&gt; to a young Duncan Keith and provided the glue holding the Hawks' defense together. He extinguishes fires defensively and makes things happen in transition.&lt;/p&gt;&lt;p&gt;Crevier, meanwhile, continues to smash through assumptions about his ceiling. His size and reach make him reliable defensively, and his strength gives him the Hawks' hardest shot, but he has &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2026/01/12/blackhawks-louis-crevier-complete-player-offensive-growth-shooting-alex-vlasic\"  target=\"_blank\"   &gt;rounded out&lt;/a&gt; his game with improved skating and passing this season.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Discouraging: Poor analytics&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;The Hawks had the worst cumulative five-on-five scoring-chance ratio in the NHL over the last three seasons combined, and they have the worst scoring-chance ratio yet again this season.&lt;/p&gt;&lt;p&gt;That ratio has improved, from 41.9% previously to 44.6% this season. But it's still dead last, and that's certainly discouraging. The Hawks also rank last in expected-goals ratio (44.3%) and second-to-last in shot ratio (45.3%).&lt;/p&gt;&lt;p&gt;Coach Jeff Blashill has brought up some interesting shortcomings of public analytics models, clarifying that the Hawks' internal analytics model paints a slightly rosier picture of their performance — although nobody disputes the fact they have a ways to go.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Encouraging: Blashill’s coaching&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;Blashill has brought time-tested authority to his role that his predecessors lacked. No offense to Jeremy Colliton or Luke Richardson, but Blashill exudes far more confidence and legitimacy.&lt;/p&gt;&lt;p&gt;Players have praised the efficiency and purposefulness of Blashill's practices and video sessions, mentioning how everything they spend time on eventually ties together in easy-to-follow and productive ways.&lt;/p&gt;&lt;p&gt;He has the Hawks running relatively complex systems designed for a real contender, not for a bottom-feeder just trying to muck up games enough to earn some points. The penalty-killing system has especially paid dividends; the Hawks rank in No. 1 in that category.&lt;/p&gt;&lt;p&gt;Fans often over-analyze lineup construction and player deployment, but it feels like Blashill and his assistants —&amp;nbsp;especially defensive assistant Anders Sorensen —&amp;nbsp;have done a generally good job with that, too.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Discouraging: Nazar’s slump&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;In October, Frank Nazar — fresh off signing a seven-year &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2025/08/21/blackhawks-frank-nazar-nhl-contract-extension-rebuild-core-piece\"  target=\"_blank\"   &gt;contract extension&lt;/a&gt; —&amp;nbsp;appeared to be making the leap everyone expected, racing out of the gates with swagger and scoring (11 points in his first 10 games).&lt;/p&gt;&lt;p&gt;Since then, however, he has tallied only 13 points in 31 games —&amp;nbsp;and missed another 16 games with a broken jaw. That trend, combined with veteran forward Andre Burakovsky's own substantial dropoff after a promising autumn, has taken some punch out of the Hawks' top six.&lt;/p&gt;&lt;p&gt;Nazar will resume centering his own line after the Olympics, and the Hawks would love to see him find a rhythm again before the season ends.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-a60000\" name=\"image-a60000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/572312f/2147483647/strip/true/crop/3000x1684+0+0/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F85%2F14%2F1b2959864ca0bc770ff75e0eaf4d%2Fnazar.jpg 1x,https://cst.brightspotcdn.com/dims4/default/6a8b2e2/2147483647/strip/true/crop/3000x1684+0+0/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F85%2F14%2F1b2959864ca0bc770ff75e0eaf4d%2Fnazar.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/af78639/2147483647/strip/true/crop/3000x1684+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F85%2F14%2F1b2959864ca0bc770ff75e0eaf4d%2Fnazar.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Frank Nazar\" srcset=\"https://cst.brightspotcdn.com/dims4/default/af78639/2147483647/strip/true/crop/3000x1684+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F85%2F14%2F1b2959864ca0bc770ff75e0eaf4d%2Fnazar.jpg 1x,https://cst.brightspotcdn.com/dims4/default/da8696a/2147483647/strip/true/crop/3000x1684+0+0/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F85%2F14%2F1b2959864ca0bc770ff75e0eaf4d%2Fnazar.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/af78639/2147483647/strip/true/crop/3000x1684+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F85%2F14%2F1b2959864ca0bc770ff75e0eaf4d%2Fnazar.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Frank Nazar hasn’t been able to replicate his October hot streak.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Nathan Denette/AP Photos&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Encouraging: Knight’s endurance&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;One Hawk who has largely sustained his early-season success is Spencer Knight, their new franchise goalie. He did fall back to Earth after spending October on Mars, but his stats remain solid. His .908 save percentage ranks 15th among 65 goalies league-wide, and his plus-12.8 GSAA ranks eighth.&lt;/p&gt;&lt;p&gt;His work last summer to prepare for a full-time starter's workload for the first time has paid off, too. He has proven he has &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2025/11/30/blackhawks-nhl-goalie-spencer-knight-off-ice-habits-red-light-mat\"  target=\"_blank\"   &gt;stamina&lt;/a&gt; and staying power.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Discouraging: Top of the Central&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;The Avalanche, Wild and Stars —&amp;nbsp;owning three of the NHL's five best records —&amp;nbsp;have a stranglehold on the Central Division that doesn't seem likely to loosen anytime soon, even if the Hawks improve enough to challenge them for it a few years down the road.&lt;/p&gt;&lt;p&gt;The Avalanche set the standard for star forward/star defenseman combo that the Hawks hope to eventually match. If the Wild manage to extend Quinn Hughes, they will match it. And the Stars' skill for prospect development also sets a standard for the Hawks to try to replicate.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Encouraging: Western mediocrity&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;The good news is the rest of the Western Conference isn't intimidating whatsoever. The playoff cutoff line is on pace to be just 92 points this season, compared to 99 in the East. If that pattern repeats itself next season, the Hawks' road to contending for a wild-card spot wouldn't be daunting.&lt;/p&gt;&lt;p&gt;Regardless, it doesn't seem like it will take long for the Hawks, &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/blackhawks/2026/01/31/blackhawks-sharks-rebuilds-connor-bedard-macklin-celebrini-mike-grier-kyle-davidson\"  target=\"_blank\"   &gt;Sharks&lt;/a&gt; and Ducks —&amp;nbsp;the three up-and-coming teams loaded with young talent —&amp;nbsp;to surpass many of their relatively aimless peers.&lt;/p&gt;",
      "author": "Ben Pope",
      "id": "https://chicago.suntimes.com/blackhawks/2026/02/08/blackhawks-season-trends-connor-bedard-frank-nazar-spencer-knight",
      "tags": []
    },
    {
      "title": "Driver died after rear-ending CTA bus on Lower West Side",
      "link": "https://chicago.suntimes.com/transportation/2026/02/08/driver-died-cta-bus-crash-lower-west-side",
      "published": "2026-02-08T10:38:50.181-06:00",
      "published_parsed": "2026-02-08T16:38:50",
      "summary": "<img alt=\"A 32-year-old driver died after rear-ending a CTA bus Sunday morning.\" src=\"https://cst.brightspotcdn.com/dims4/default/afc1036/2147483647/strip/true/crop/1024x630+0+0/resize/840x517!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Faf%2F4b%2F87119107c5b30bb39db27ed2bbce%2Fcta-bus.jpg\" />\n        \n        \n            &lt;p&gt;A driver died after crashing into the back of a stationary CTA bus early Sunday in the Lower West Side neighborhood, Chicago police said. &lt;/p&gt;&lt;p&gt;The bus, with five passengers onboard, was waiting at a red light in the 2300 block of South Blue Island Avenue around 4:30 a.m. Sunday. The driver, 32, was in an SUV traveling in the same direction when he crashed into the rear of the bus, according to police.&lt;/p&gt;&lt;p&gt;He was taken to Stroger Hospital where he was pronounced dead. No other injuries were reported. &lt;/p&gt;",
      "author": "Sun-Times Wire",
      "id": "https://chicago.suntimes.com/transportation/2026/02/08/driver-died-cta-bus-crash-lower-west-side",
      "tags": []
    },
    {
      "title": "Driver killed in I-94 crash involving semi-truck on Far South Side",
      "link": "https://chicago.suntimes.com/transportation/2026/02/08/driver-killed-i-94-crash-semi-truck-far-south-side",
      "published": "2026-02-08T10:28:55.696-06:00",
      "published_parsed": "2026-02-08T16:28:55",
      "summary": "<img alt=\"A fatal highway crash happened early Sunday on the Far South Side, according to Illinois State Police.\" src=\"https://cst.brightspotcdn.com/dims4/default/d427576/2147483647/strip/true/crop/5512x3676+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa2%2Ff4%2F783e85ad4a92a2c9be555b965b25%2Fisp-022824-02.JPG\" />\n        \n        \n            &lt;p&gt;A driver died in a crash involving a semi-truck on I-94 early Sunday on the Far South Side.&lt;/p&gt;&lt;p&gt;The crash happened around 1:15 a.m. Sunday in the southbound lanes near the 130th Street exit on I-94, according to the Illinois State Police. The driver, who was in a Nissan SUV, was taken to a nearby hospital where they were pronounced dead.&lt;/p&gt;&lt;p&gt;The semi-truck driver was also injured and taken to a local hospital, according to state police.&lt;/p&gt;&lt;p&gt;All southbound lanes were closed until 5 a.m. Sunday. The cause of the crash remains under investigation.&lt;/p&gt;",
      "author": "Sun-Times Wire",
      "id": "https://chicago.suntimes.com/transportation/2026/02/08/driver-killed-i-94-crash-semi-truck-far-south-side",
      "tags": []
    },
    {
      "title": "Bears to promote Press Taylor to offensive coordinator to replace Declan Doyle: source",
      "link": "https://chicago.suntimes.com/bears/2026/02/08/bears-to-promote-press-taylor-to-offensive-coordinator-to-replace-declan-doyle-source",
      "published": "2026-02-08T10:24:34.667-06:00",
      "published_parsed": "2026-02-08T16:24:34",
      "summary": "<img alt=\"Chicago Bears offensive coordinator Declan Doyle and passing game coordinator Press Taylor chat on the first day of training camp at Halas Hall in Lake Forest, Wednesday, July 23, 2025. \" src=\"https://cst.brightspotcdn.com/dims4/default/6eae84b/2147483647/strip/true/crop/4080x2721+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fed%2Fc9%2F37c0ee7b487a8fbbb2e03739aa90%2Fdoyle-taylor.jpg\" />\n        \n        \n            &lt;p&gt;&lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears\"  target=\"_blank\"   &gt;Bears&lt;/a&gt; coach Ben Johnson will maintain continuity offensively by promoting passing-game coordinator Press Taylor to offensive coordinator, a source said. That would end a relatively short search after coordinator Declan Doyle left for the Ravens a little over a week ago.&lt;/p&gt;&lt;p&gt;Any change at offensive coordinator is unlikely to be a significant issue for the Bears as they run Johnson’s offense and he is their play caller.&lt;/p&gt;&lt;p&gt;Taylor was the Jaguars’ offensive coordinator from 2022 through ’24 before joining Johnson’s staff last year. He also was a longtime assistant for the Eagles under coaches Chip Kelly and Doug Pederson and won a Super Bowl ring as assistant quarterbacks coach for them in 2017.&lt;/p&gt;&lt;p&gt;Taylor said last season that Johnson set the agenda for coaching quarterback Caleb Williams, and quarterbacks coach J.T. Barrett handled the day-to-day details. &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears/2025/08/13/ben-johnson-j-t-barrett-part-of-5-man-crew-working-to-get-caleb-williams-immersed-in-offense-by-week-1\"   &gt;He and Doyle would “chime in”&lt;/a&gt; during group discussions, Taylor said.&lt;/p&gt;&lt;p&gt;Doyle was on the sideline and Taylor was up in the booth last season, and Johnson relied on them to “feed me the story” of what was working offensively, whether players were missing assignments and what the opponent’s defensive coverage tendencies were.&lt;/p&gt;&lt;p&gt;Taylor, 38, got his start in coaching as a graduate assistant at Tulsa after playing quarterback at Marshall. Kelly hired him as a low-level assistant in 2013, and he rose to quarterbacks coach for Carson Wentz under Pederson by 2018.&lt;/p&gt;&lt;p&gt;When the Eagles cleaned house after the 2020 season, Taylor spent a season with the Colts before Pederson hired him as offensive coordinator for the Jaguars to work with Trevor Lawrence.&lt;/p&gt;&lt;p&gt;The Jaguars were seventh in scoring in Taylor’s first season, but slipped to 14th in 2023 and 25th in ’24 before they fired Pederson and his staff.&lt;/p&gt;&lt;p&gt;Taylor’s older brother, Zac, is head coach of the Bengals.&lt;/p&gt;&lt;p&gt;The Bears needed to move relatively quickly as they progress in draft preparations and head to the NFL Scouting Combine in two weeks.&lt;/p&gt;&lt;p&gt;The Bears don’t necessarily need to fill Taylor’s position, but it gives Johnson a chance to add an assistant. He already brought in new running backs coach Eric Studesville after Eric Bieniemy went back to the Chiefs as offensive coordinator.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;bsp-list-loadmore class=\"PageListH\" data-module data-hide-authors=\"true\" data-hide-categories=\"true\" data-hide-dates=\"true\" data-show-loadmore=\"true\"\n&gt;&lt;a class=\"AnchorLink\" id=\"list-bc0001\" name=\"list-bc0001\"&gt;&lt;/a&gt;&lt;div class=\"PageList-header\" &gt;\n    &lt;div class=\"PageList-header-title-wrap\" &gt;\n        \n            &lt;div class=\"PageList-header-title\"&gt;\n            \n                &lt;a class=\"\" href=\"https://chicago.suntimes.com/bears\" target=\"{borderColor=#dfdfdf, pageNumber=1, inverseColors=false, footerBgColor=#000000, bodyFont=font-3, showListNumbers=false, imagePositionHorizontal=null, rteBodyFont=font-3, headerBottomBorderColor=#111010, titleUrl=https://chicago.suntimes.com/bears, subTitle=null, stickyHeader=true, listTitleColor=#000000, tableCellBorderColor=#ccd1d5, relatedListFont=font-1, hideAuthors=true, tertiaryTextColor=#6c6c6c, buttonHoverTextColor=#ffffff, tableFont=font-1, carouselAutoPlay=false, promoTitleFont=font-2, _styledTemplate=/page/list/PageListH.hbs, ctaButtonText=[], primaryTextColor=#2a2a2a, buttonTextColor=#ffffff, linkTextColor=#1a1a1a, hideTitles=false, footerLinkColor=#ffffff, items=[{type=Image, media=[{alt=Super Bowl Football, ampLink=null, _styledTemplate=null, _template=/image/Image.hbs, image={src=https://cst.brightspotcdn.com/f0/24/8f9a4cad4bfdb1077f131787f1a4/ap26034226663589.jpg, width=6500, height=4265}, narrowImage={src=https://cst.brightspotcdn.com/f0/24/8f9a4cad4bfdb1077f131787f1a4/ap26034226663589.jpg, width=6500, height=4265}}], authors=[{bio=[{items=[Jason Lieser covers the Chicago Bears for the Chicago Sun-Times.]}], media=[{image={src=https://cst.brightspotcdn.com/db/45/4fa7d0e60b81cf16ace05e7c41e9/f5kj4hj-400x400-0.jpg, width=512, height=512}, narrowImage={src=https://cst.brightspotcdn.com/db/45/4fa7d0e60b81cf16ace05e7c41e9/f5kj4hj-400x400-0.jpg, width=512, height=512}, ampLink=null, _styledTemplate=null, _template=/image/Image.hbs, alt=Headshot of Chicago Bears reporter Jason Lieser}], ampLink=null, _styledTemplate=null, name=[{items=[Jason Lieser]}], _template=/author/byline/AuthorByline.hbs, authorPageUrl=https://chicago.suntimes.com/authors/jason-lieser, jobTitle=[{items=[Chicago Bears reporter]}]}], _styledTemplate=null, wordCount=963, imageAlignment=null, url=https://chicago.suntimes.com/bears/2026/02/08/super-bowl-lx-preview-seahawks-patriots-carry-weight-of-franchise-legacies-in-very-different-ways, isFeatured=false, publishDate=February 08, 2026 06:00 AM, anchorId=promo-c50000, target=null, primaryMediaType=null, category=[{items=[Bears]}], categoryUrl=https://chicago.suntimes.com/bears, title=Super Bowl LX preview: Seahawks, Patriots carry weight of franchise legacies in very different ways, ampLink=null, audio=[], audioDuration=null, timestamp=1770552000000, description=[{items=[Plus, what to watch for when the Seahawks have the ball (Sam Darnold is the real deal) and when Patriots have the ball (rookie running back TreVeyon Henderson must produce).]}], _template=/page/promo/PagePromo.hbs}, {type=Image, category=[{items=[Bears]}], description=[{items=[The Bears drafted him ninth overall expecting he’d be an elite game-changer. Odunze’s first two seasons were good, but “absolutely” an underachievement in his eyes.]}], publishDate=February 07, 2026 08:45 AM, _styledTemplate=null, imageAlignment=null, isFeatured=false, anchorId=promo-c50001, media=[{alt=Rams Bears Football, ampLink=null, _styledTemplate=null, _template=/image/Image.hbs, image={src=https://cst.brightspotcdn.com/8d/9d/0a7be7d24f48ae70670b53ea4b67/ap26019625700470.jpg, width=4500, height=3000}, narrowImage={src=https://cst.brightspotcdn.com/8d/9d/0a7be7d24f48ae70670b53ea4b67/ap26019625700470.jpg, width=4500, height=3000}}], target=null, primaryMediaType=null, wordCount=597, categoryUrl=https://chicago.suntimes.com/bears, timestamp=1770475500000, authors=[{ampLink=null, _styledTemplate=null, _template=/author/byline/AuthorByline.hbs, authorPageUrl=https://chicago.suntimes.com/authors/jason-lieser, media=[{image={src=https://cst.brightspotcdn.com/db/45/4fa7d0e60b81cf16ace05e7c41e9/f5kj4hj-400x400-0.jpg, width=512, height=512}, narrowImage={src=https://cst.brightspotcdn.com/db/45/4fa7d0e60b81cf16ace05e7c41e9/f5kj4hj-400x400-0.jpg, width=512, height=512}, ampLink=null, _styledTemplate=null, _template=/image/Image.hbs, alt=Headshot of Chicago Bears reporter Jason Lieser}], jobTitle=[{items=[Chicago Bears reporter]}], name=[{items=[Jason Lieser]}], bio=[{items=[Jason Lieser covers the Chicago Bears for the Chicago Sun-Times.]}]}], ampLink=null, url=https://chicago.suntimes.com/bears/2026/02/07/you-either-do-or-you-dont-bears-wr-rome-odunze-harsh-critic-of-himself-despite-improvement, audio=[], audioDuration=null, _template=/page/promo/PagePromo.hbs, title=&amp;#x27;You either do or you don&amp;#x27;t&amp;#x27;: Bears WR Rome Odunze harsh critic of himself despite improvement}, {type=Image, url=https://chicago.suntimes.com/bears/2026/02/07/in-saga-of-2024-nfl-draft-class-patriots-drake-maye-leads-bears-caleb-williams-others-in-year-2, wordCount=896, timestamp=1770472800000, _styledTemplate=null, imageAlignment=null, isFeatured=false, anchorId=promo-c50002, category=[{items=[Bears]}], description=[{items=[Williams has been good enough in his first two seasons to warrant a wait-and-see view of the 2024 class. This is nowhere near the conversation that hounded Mitch Trubisky as Patrick Mahomes and Deshaun Watson soared; it’s merely a snapshot of where things stand at the moment.]}], media=[{alt=Super Bowl Football, image={src=https://cst.brightspotcdn.com/94/d5/e1f997a94d84ab885eabbc8e1556/ap26037832571439.jpg, width=3797, height=2531}, ampLink=null, _styledTemplate=null, _template=/image/Image.hbs, narrowImage={src=https://cst.brightspotcdn.com/94/d5/e1f997a94d84ab885eabbc8e1556/ap26037832571439.jpg, width=3797, height=2531}}], publishDate=February 07, 2026 08:00 AM, target=null, primaryMediaType=null, categoryUrl=https://chicago.suntimes.com/bears, ampLink=null, title=In saga of 2024 NFL Draft class, Patriots&amp;#x27; Drake Maye leads Bears&amp;#x27; Caleb Williams, others in Year 2, audio=[], audioDuration=null, _template=/page/promo/PagePromo.hbs, authors=[{name=[{items=[Jason Lieser]}], ampLink=null, _styledTemplate=null, _template=/author/byline/AuthorByline.hbs, authorPageUrl=https://chicago.suntimes.com/authors/jason-lieser, jobTitle=[{items=[Chicago Bears reporter]}], bio=[{items=[Jason Lieser covers the Chicago Bears for the Chicago Sun-Times.]}], media=[{image={src=https://cst.brightspotcdn.com/db/45/4fa7d0e60b81cf16ace05e7c41e9/f5kj4hj-400x400-0.jpg, width=512, height=512}, narrowImage={src=https://cst.brightspotcdn.com/db/45/4fa7d0e60b81cf16ace05e7c41e9/f5kj4hj-400x400-0.jpg, width=512, height=512}, ampLink=null, _styledTemplate=null, _template=/image/Image.hbs, alt=Headshot of Chicago Bears reporter Jason Lieser}]}]}], carouselSpeed=null, buttonHoverBgColor=#a91d23, rteHeadingFont=font-1, secondaryColor=#656565, hideCategories=true, _template=/page/list/includes/PageList-header.hbs, font3=Arial, font4=Source-serif-4, count=20456, ctaUrl=null, pageCount=6819, hideImage=false, suppressPagination=true, footerLinkHoverColor=#d3242c, hideAudioPlayback=false, description=[], showSecondItemMedia=false, listColumns234=null, footerTextColor=#ffffff, title=Latest on the Bears, headerSecondaryBgColor=#000000, primaryTextColorInverse=#ffffff, titleColor=null, ampLink=null, listHeaderPosition=null, hideDescriptions=false, showActionBar=true, linkHoverColor=#d3242c, buttonBgColor=#d3242c, ctaTarget=null, anchorId=list-bc0001, promoButtonText=null, backgroundColor=null, headerSecondaryTextColor=#ffffff, listTitleFont=font-2, headlineFont=font-1, promoDescriptionFont=font-3, primaryColor=#d3242c, slimFooter=false, hideHeadline=false, hideDates=true, headerBorderColor=#e9e9e9, ratingCardFont=font-1, titleTarget=null, tableCaptionColor=#626262, mobileCarousel=false, tableEvenRowsBgColor=#f9f8f3, containerTitleFont=font-2, listBorderColor=#dfdfdf, defaultArticleLeadStyle=standard, pullQuoteIcon=[{image=null, narrowImage=null, _template=/image/Image.hbs, alt=null}], pagination=[{body=[Next Page], href=?p=2, _template=/link/Link.hbs, contentId=null, pianoSectionSlug=null, target=null}], _parentFiles=[/page/list/includes/PageList-header.hbs]}\"&gt;Latest on the Bears&lt;/a&gt;\n            \n            &lt;/div&gt;\n        \n\n        \n    &lt;/div&gt;\n\n    \n    \n&lt;/div&gt;\n\n\n    \n        &lt;div class=\"PageListH-items\" data-with-borders data-list-loadmore-items&gt;\n            \n            &lt;div class=\"PageListH-items-item\"&gt;&lt;div class=\"PagePromoB\"&gt;\n    \n        \n    &lt;div class=\"PagePromo-media\"&gt;&lt;a class=\"Link\" aria-label=\"Super Bowl LX preview: Seahawks, Patriots carry weight of franchise legacies in very different ways\" href=\"https://chicago.suntimes.com/bears/2026/02/08/super-bowl-lx-preview-seahawks-patriots-carry-weight-of-franchise-legacies-in-very-different-ways\" &gt;&lt;picture data-crop=\"medium-4x3\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n                &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"328\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/4b55409/2147483647/strip/true/crop/6371x4265+129+0/resize/490x328!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff0%2F24%2F8f9a4cad4bfdb1077f131787f1a4%2Fap26034226663589.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n            \n        \n    \n\n    \n        &lt;source width=\"490\"\n     height=\"328\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/e588766/2147483647/strip/true/crop/6371x4265+129+0/resize/490x328!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff0%2F24%2F8f9a4cad4bfdb1077f131787f1a4%2Fap26034226663589.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Super Bowl Football\" width=\"490\" height=\"328\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/e588766/2147483647/strip/true/crop/6371x4265+129+0/resize/490x328!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff0%2F24%2F8f9a4cad4bfdb1077f131787f1a4%2Fap26034226663589.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n&lt;/a&gt;&lt;/div&gt;\n\n\n    \n\n    &lt;div class=\"PagePromoB-content\"&gt;\n        \n    &lt;div class=\"PagePromo-category\"&gt;\n        &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears\"   &gt;Bears&lt;/a&gt;\n    &lt;/div&gt;\n\n\n\n        \n    &lt;div class=\"PagePromo-title\"&gt;\n        &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears/2026/02/08/super-bowl-lx-preview-seahawks-patriots-carry-weight-of-franchise-legacies-in-very-different-ways\"   &gt;Super Bowl LX preview: Seahawks, Patriots carry weight of franchise legacies in very different ways&lt;/a&gt;\n    &lt;/div&gt;\n\n\n\n        \n    &lt;div class=\"PagePromo-description\"&gt;Plus, what to watch for when the Seahawks have the ball (Sam Darnold is the real deal) and when Patriots have the ball (rookie running back TreVeyon Henderson must produce).&lt;/div&gt;\n\n\n\n        \n\n        \n    &lt;div class=\"PagePromo-byline\"&gt;&lt;div class=\"PagePromo-date\"&gt;\n                    &lt;bsp-timestamp data-timestamp=1770552000000 data-promo=\"true\"&gt;\n                        &lt;template data-date-tpl&gt;[month] [day], [year], [hour]:[minute][ampm] [timezone]&lt;/template&gt;\n                        &lt;span data-date&gt;&amp;nbsp;&lt;/span&gt;\n                    &lt;/bsp-timestamp&gt;&lt;span class=\"dot\"&gt;&lt;/span&gt;&lt;/div&gt;\n                &lt;div class=\"PagePromo-author\"&gt;\n                    &lt;span&gt;By&amp;nbsp;&lt;/span&gt;&lt;strong&gt;&lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/authors/jason-lieser\"   &gt;Jason Lieser\n&lt;/a&gt;&lt;/strong&gt;\n                    \n                &lt;/div&gt;\n            \n  &lt;div class=\"PagePromo-readingTime\"&gt;\n    &lt;span class=\"dot-divider\"&gt;&lt;/span&gt;\n    &lt;svg class=\"PagePromo-readingTime-icon\"&gt;\n      &lt;use xlink:href=\"#icon-clock-reading\"&gt;&lt;/use&gt;\n    &lt;/svg&gt;\n    &lt;span class=\"PagePromo-readingTime-text\"&gt;\n      &lt;bsp-time-to-read data-article-word-count=\"963\"&gt;&lt;/bsp-time-to-read&gt; read\n    &lt;/span&gt;\n\n  &lt;/div&gt;\n&lt;/div&gt;\n\n\n\n        \n\n    &lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n            \n            &lt;div class=\"PageListH-items-item\"&gt;&lt;div class=\"PagePromoB\"&gt;\n    \n        \n    &lt;div class=\"PagePromo-media\"&gt;&lt;a class=\"Link\" aria-label=\"&amp;#x27;You either do or you don&amp;#x27;t&amp;#x27;: Bears WR Rome Odunze harsh critic of himself despite improvement\" href=\"https://chicago.suntimes.com/bears/2026/02/07/you-either-do-or-you-dont-bears-wr-rome-odunze-harsh-critic-of-himself-despite-improvement\" &gt;&lt;picture data-crop=\"medium-4x3\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n                &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"328\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/c83b86e/2147483647/strip/true/crop/4482x3000+18+0/resize/490x328!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8d%2F9d%2F0a7be7d24f48ae70670b53ea4b67%2Fap26019625700470.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n            \n        \n    \n\n    \n        &lt;source width=\"490\"\n     height=\"328\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/ff66bee/2147483647/strip/true/crop/4482x3000+18+0/resize/490x328!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8d%2F9d%2F0a7be7d24f48ae70670b53ea4b67%2Fap26019625700470.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Rams Bears Football\" width=\"490\" height=\"328\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/ff66bee/2147483647/strip/true/crop/4482x3000+18+0/resize/490x328!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8d%2F9d%2F0a7be7d24f48ae70670b53ea4b67%2Fap26019625700470.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n&lt;/a&gt;&lt;/div&gt;\n\n\n    \n\n    &lt;div class=\"PagePromoB-content\"&gt;\n        \n    &lt;div class=\"PagePromo-category\"&gt;\n        &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears\"   &gt;Bears&lt;/a&gt;\n    &lt;/div&gt;\n\n\n\n        \n    &lt;div class=\"PagePromo-title\"&gt;\n        &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears/2026/02/07/you-either-do-or-you-dont-bears-wr-rome-odunze-harsh-critic-of-himself-despite-improvement\"   &gt;&amp;#x27;You either do or you don&amp;#x27;t&amp;#x27;: Bears WR Rome Odunze harsh critic of himself despite improvement&lt;/a&gt;\n    &lt;/div&gt;\n\n\n\n        \n    &lt;div class=\"PagePromo-description\"&gt;The Bears drafted him ninth overall expecting he’d be an elite game-changer. Odunze’s first two seasons were good, but “absolutely” an underachievement in his eyes.&lt;/div&gt;\n\n\n\n        \n\n        \n    &lt;div class=\"PagePromo-byline\"&gt;&lt;div class=\"PagePromo-date\"&gt;\n                    &lt;bsp-timestamp data-timestamp=1770475500000 data-promo=\"true\"&gt;\n                        &lt;template data-date-tpl&gt;[month] [day], [year], [hour]:[minute][ampm] [timezone]&lt;/template&gt;\n                        &lt;span data-date&gt;&amp;nbsp;&lt;/span&gt;\n                    &lt;/bsp-timestamp&gt;&lt;span class=\"dot\"&gt;&lt;/span&gt;&lt;/div&gt;\n                &lt;div class=\"PagePromo-author\"&gt;\n                    &lt;span&gt;By&amp;nbsp;&lt;/span&gt;&lt;strong&gt;&lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/authors/jason-lieser\"   &gt;Jason Lieser\n&lt;/a&gt;&lt;/strong&gt;\n                    \n                &lt;/div&gt;\n            \n  &lt;div class=\"PagePromo-readingTime\"&gt;\n    &lt;span class=\"dot-divider\"&gt;&lt;/span&gt;\n    &lt;svg class=\"PagePromo-readingTime-icon\"&gt;\n      &lt;use xlink:href=\"#icon-clock-reading\"&gt;&lt;/use&gt;\n    &lt;/svg&gt;\n    &lt;span class=\"PagePromo-readingTime-text\"&gt;\n      &lt;bsp-time-to-read data-article-word-count=\"597\"&gt;&lt;/bsp-time-to-read&gt; read\n    &lt;/span&gt;\n\n  &lt;/div&gt;\n&lt;/div&gt;\n\n\n\n        \n\n    &lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n            \n            &lt;div class=\"PageListH-items-item\"&gt;&lt;div class=\"PagePromoB\"&gt;\n    \n        \n    &lt;div class=\"PagePromo-media\"&gt;&lt;a class=\"Link\" aria-label=\"In saga of 2024 NFL Draft class, Patriots&amp;#x27; Drake Maye leads Bears&amp;#x27; Caleb Williams, others in Year 2\" href=\"https://chicago.suntimes.com/bears/2026/02/07/in-saga-of-2024-nfl-draft-class-patriots-drake-maye-leads-bears-caleb-williams-others-in-year-2\" &gt;&lt;picture data-crop=\"medium-4x3\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n                &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"328\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/6f32d71/2147483647/strip/true/crop/3781x2531+0+0/resize/490x328!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F94%2Fd5%2Fe1f997a94d84ab885eabbc8e1556%2Fap26037832571439.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n            \n        \n    \n\n    \n        &lt;source width=\"490\"\n     height=\"328\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/db26a14/2147483647/strip/true/crop/3781x2531+0+0/resize/490x328!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F94%2Fd5%2Fe1f997a94d84ab885eabbc8e1556%2Fap26037832571439.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Super Bowl Football\" width=\"490\" height=\"328\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/db26a14/2147483647/strip/true/crop/3781x2531+0+0/resize/490x328!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F94%2Fd5%2Fe1f997a94d84ab885eabbc8e1556%2Fap26037832571439.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjhweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n&lt;/a&gt;&lt;/div&gt;\n\n\n    \n\n    &lt;div class=\"PagePromoB-content\"&gt;\n        \n    &lt;div class=\"PagePromo-category\"&gt;\n        &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears\"   &gt;Bears&lt;/a&gt;\n    &lt;/div&gt;\n\n\n\n        \n    &lt;div class=\"PagePromo-title\"&gt;\n        &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/bears/2026/02/07/in-saga-of-2024-nfl-draft-class-patriots-drake-maye-leads-bears-caleb-williams-others-in-year-2\"   &gt;In saga of 2024 NFL Draft class, Patriots&amp;#x27; Drake Maye leads Bears&amp;#x27; Caleb Williams, others in Year 2&lt;/a&gt;\n    &lt;/div&gt;\n\n\n\n        \n    &lt;div class=\"PagePromo-description\"&gt;Williams has been good enough in his first two seasons to warrant a wait-and-see view of the 2024 class. This is nowhere near the conversation that hounded Mitch Trubisky as Patrick Mahomes and Deshaun Watson soared; it’s merely a snapshot of where things stand at the moment.&lt;/div&gt;\n\n\n\n        \n\n        \n    &lt;div class=\"PagePromo-byline\"&gt;&lt;div class=\"PagePromo-date\"&gt;\n                    &lt;bsp-timestamp data-timestamp=1770472800000 data-promo=\"true\"&gt;\n                        &lt;template data-date-tpl&gt;[month] [day], [year], [hour]:[minute][ampm] [timezone]&lt;/template&gt;\n                        &lt;span data-date&gt;&amp;nbsp;&lt;/span&gt;\n                    &lt;/bsp-timestamp&gt;&lt;span class=\"dot\"&gt;&lt;/span&gt;&lt;/div&gt;\n                &lt;div class=\"PagePromo-author\"&gt;\n                    &lt;span&gt;By&amp;nbsp;&lt;/span&gt;&lt;strong&gt;&lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/authors/jason-lieser\"   &gt;Jason Lieser\n&lt;/a&gt;&lt;/strong&gt;\n                    \n                &lt;/div&gt;\n            \n  &lt;div class=\"PagePromo-readingTime\"&gt;\n    &lt;span class=\"dot-divider\"&gt;&lt;/span&gt;\n    &lt;svg class=\"PagePromo-readingTime-icon\"&gt;\n      &lt;use xlink:href=\"#icon-clock-reading\"&gt;&lt;/use&gt;\n    &lt;/svg&gt;\n    &lt;span class=\"PagePromo-readingTime-text\"&gt;\n      &lt;bsp-time-to-read data-article-word-count=\"896\"&gt;&lt;/bsp-time-to-read&gt; read\n    &lt;/span&gt;\n\n  &lt;/div&gt;\n&lt;/div&gt;\n\n\n\n        \n\n    &lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n            \n        &lt;/div&gt;\n    \n\n    \n&lt;div class=\"PageList-footer\"&gt;\n    \n&lt;/div&gt;\n\n\n&lt;/bsp-list-loadmore&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Jason Lieser",
      "id": "https://chicago.suntimes.com/bears/2026/02/08/bears-to-promote-press-taylor-to-offensive-coordinator-to-replace-declan-doyle-source",
      "tags": []
    },
    {
      "title": "One of the most expensive paintings ever sold by a living artist once hung largely unnoticed in a Chicago hotel lobby",
      "link": "https://chicago.suntimes.com/columnists/2026/02/08/gerhard-richter-most-expensive-painting-ever-sold-2013-park-hyatt-chicago-lobby",
      "published": "2026-02-08T09:54:20.456-06:00",
      "published_parsed": "2026-02-08T15:54:20",
      "summary": "<img alt=\"Workers remove the painting &quot;Domplatz, Mailand&quot; by German painter Gerhard Richter in 2002 from the lobby of the Park Hyatt in Chicago, so it could be displayed at various world-renowned art museums.\" src=\"https://cst.brightspotcdn.com/dims4/default/1b342c9/2147483647/strip/true/crop/2000x1312+0+0/resize/840x551!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F3c%2Fc5%2Fb95e3bd24b53858655aafb8e79f0%2F2-6-white-3-million-painting-3.JPG\" />\n        \n        \n            &lt;p&gt;Hotels are not famous for fine art. Just the opposite. Once showcases for generic mass-produced canvases ranging from kitsch to trash, lately they lean toward cutesy black and white photos echoing the visual cliche of the moment. Vintage cars. Soda signs. Cowboys.&lt;/p&gt;&lt;p&gt;So you are forgiven for missing the fact that, for years, what would become the most expensive painting ever sold by a living artist hung largely unnoticed  in a downtown Chicago hotel lobby.&lt;/p&gt;&lt;p&gt;It was \"Domplatz, Mailand\" by Gerhard Richter, who is still alive — in fact, Monday, Feb. 9 is his 94th birthday.    Richter is having a banner year, with a big show in Paris, and since my going is out of the question, the second best thing is to tell how one of his major works ended up next to the front desk at the Park Hyatt Chicago on Michigan Avenue, and why it is now gone.&lt;/p&gt;&lt;div class=\"RichTextSidebarModule Enhancement\" data-module data-align-center&gt;&lt;a class=\"AnchorLink\" id=\"module-ea0000\" name=\"module-ea0000\"&gt;&lt;/a&gt;\n        &lt;div class=\"RichTextSidebarModule-title\"&gt;Opinion bug&lt;/div&gt;\n    \n\n    \n\n    \n    &lt;div class=\"RichTextModule-items RichTextBody\"&gt;&lt;h2&gt;Opinion&lt;/h2&gt;&lt;/div&gt;\n\n\n&lt;/div&gt;&lt;p&gt;The Pritzker family — the clan of Illinois'  governor — runs the Hyatt chain of over 1,000 hotels. In 2000, wanting something to jazz up its new crown jewel, the Park Hyatt Chicago, a 70-story edifice at the corner of Michigan and Chicago, the Pritzkers decided to dig deep.&lt;/p&gt;&lt;p&gt;“When we were building the hotel, my cousin, Nick, said, ‘Let’s go all in and get a great piece of art,'\" Thomas Pritzker, then CEO and now executive chairman, of the Pritzker organization, &lt;a class=\"Link\"  href=\"https://www.blogger.com/blog/post/edit/3972382144120426476/1331396329574314552#\"  target=\"_blank\"   &gt;told Sotheby’s&lt;/a&gt; in 2014. “So he chose the Richter.\"&lt;/p&gt;&lt;p&gt;Richter is an abstract German artist whose work is something of the love child of impressionism and photo realism. \"Domplatz, Mailand\" was commissioned in 1968 by the Siemens Corporation, the German technology conglomerate, for its Milan headquarters and shows a blurry black and white image of the Cathedral Square there.&lt;/p&gt;&lt;p&gt;Hyatt bought the painting in London for $3.6 million — not exactly cheap to begin with — and hung it in the Park Hyatt.&lt;/p&gt;&lt;p&gt;I could pretend I know about the painting because my thumb is pressed on the pulse of all things cultural. Though the truth may be actually even cooler, in a lunch bucket vibe way. I've never stayed at the Park Hyatt. The only reason the hotel is on my radar is because it was erected during the late 1990s building boom. Tower cranes were everywhere and, curious guy that I am, I started wondering about the cranes — how do they get up there? — so took a closer look.&lt;/p&gt;&lt;p&gt;In 1999, crackerjack photographer Robert A. Davis and I visited the crane atop the nearly-completed Park Hyatt. That adventure bonded me to the place — being at the tip of the crane boom as it swung out 600 feet over Michigan Avenue will do that — and I made a point of circling back to see what it looked like when finished. The Richter caught my eye; it's hard to miss  being nine feet square. Guiding out-of-town guests through their Magnificent Mile window shopping, I'd detour into the hotel to check it out.&lt;/p&gt;&lt;p&gt;The painting hung in the lobby for 15 years, except during 2002, when the hotel lent it to the Museum of Modern Art for a traveling retrospective of 40 years of Richter's work that included the Art Institute of Chicago.&lt;/p&gt;&lt;p&gt;Given the schlock that hangs on most hotel walls, we ought to bow our heads for a moment in honor of that. Chicago hotels were once so well decorated that they'd loan their artwork to major museums. And LaSalle Bank used to have a full-time photo curator to manage its first-rate photography collection, before Bank of America bought it and stripped its soul like the spine being lifted out of a whitefish.&lt;/p&gt;&lt;p&gt;Fine art costs money — even insuring it costs a lot — and the airy aspirations of the chain owners ran into the practical considerations of the bean counters. &lt;/p&gt;&lt;p&gt;“When we were updating our insurance policies, we figured out the value,” Pritzker said. “I was astounded. Hyatt is a public company, and our job is to create shareholder value, so we decided it was in the best interest to sell it. But we would redeploy that capital in an art program.”&lt;/p&gt;&lt;p&gt;Create value they did, selling the painting in May 2013 for $37.1 million, a hefty profit and a record for a living artist at the time. (Surpassed that November, by a Jeff Koons balloon dog fetching $58 million.)&lt;/p&gt;&lt;p&gt;\"It worked out really well.” Pritzker said.&lt;/p&gt;&lt;p&gt;The only question left: What is hanging in the Richter's place? I headed over, hoping it would be an anonymous hemp fabric sculpture or generic painting of ducks. No such luck: a dramatic and colorful painting by Richard Prince that guests routinely mistake for a work by Jean-Michel Basquiat. Value, only about $1 million.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-8e0000\" name=\"image-8e0000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/c328d32/2147483647/strip/true/crop/3931x2206+0+371/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F62%2F66%2F98fff50149b1872e15d6c23b46de%2Fimg-5966.jpeg 1x,https://cst.brightspotcdn.com/dims4/default/b198d35/2147483647/strip/true/crop/3931x2206+0+371/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F62%2F66%2F98fff50149b1872e15d6c23b46de%2Fimg-5966.jpeg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/7065730/2147483647/strip/true/crop/3931x2206+0+371/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F62%2F66%2F98fff50149b1872e15d6c23b46de%2Fimg-5966.jpeg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"IMG_5966.jpeg\" srcset=\"https://cst.brightspotcdn.com/dims4/default/7065730/2147483647/strip/true/crop/3931x2206+0+371/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F62%2F66%2F98fff50149b1872e15d6c23b46de%2Fimg-5966.jpeg 1x,https://cst.brightspotcdn.com/dims4/default/bada939/2147483647/strip/true/crop/3931x2206+0+371/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F62%2F66%2F98fff50149b1872e15d6c23b46de%2Fimg-5966.jpeg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/7065730/2147483647/strip/true/crop/3931x2206+0+371/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F62%2F66%2F98fff50149b1872e15d6c23b46de%2Fimg-5966.jpeg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;The painting by Richard Prince in the lobby of the Park Hyatt Chicago is untitled, but desk clerks there have nicknamed it “Not a Basquiat” for guests’ tendency to mistake it for a painting by the late, ultra-hip artist, Jean-Michel Basquiat.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Photo by Neil Steinberg&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Neil Steinberg",
      "id": "https://chicago.suntimes.com/columnists/2026/02/08/gerhard-richter-most-expensive-painting-ever-sold-2013-park-hyatt-chicago-lobby",
      "tags": []
    },
    {
      "title": "New Bull Rob Dillingham in search of confidence that was stripped away",
      "link": "https://chicago.suntimes.com/bulls/2026/02/08/new-bull-rob-dillingham-search-confidence-stripped-away",
      "published": "2026-02-08T13:51:26.235-06:00",
      "published_parsed": "2026-02-08T19:51:26",
      "summary": "<img alt=\"Shifty point guard Rob Dillingham showed flashes in his Saturday debut, but still has more questions than answers surrounding him.\" src=\"https://cst.brightspotcdn.com/dims4/default/20c5733/2147483647/strip/true/crop/6463x4309+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff4%2Ff5%2F2529525542f4a668d7becce42488%2Fnuggets-bulls-basketball-1.jpg\" />\n        \n        \n            &lt;p&gt;Say it without saying it.&lt;/p&gt;&lt;p&gt;That’s what new Bull Rob Dillingham has been pulling off the last few days since arriving in a trade, maneuvering through his explanation of what went wrong with his Timberwolves experience with the same slipperiness that he darts through an opposing defensive set.&lt;/p&gt;&lt;p&gt;A source indicated that Dillingham and Minnesota coach Chris Finch quickly fell off the same page after the guard was selected No. 8 overall in the 2024 draft, but while Dillingham is only 21, he wasn’t going to get caught up in a he said-he said NBA drama.&lt;/p&gt;&lt;p&gt;What was obvious, however, was he arrived with the Bulls somewhat stripped of his confidence. He didn’t hide that.&lt;/p&gt;&lt;p&gt;“Just confidence,” Dillingham responded, when asked what he needed to do to take the next step in his NBA journey. “Confidence from my teammates, confidence from my coaches. I just feel like I haven’t gotten a super opportunity where I feel confident. Just gaining that back and realizing I’ve been working the whole time so it’s not like it automatically left where I wasn’t as good. I’m just waiting for the spark to come back.”&lt;/p&gt;&lt;p&gt;The first flicker came on Saturday.&lt;/p&gt;&lt;p&gt;Dillingham not only played a season-high 22 minutes in his Bulls debut but scored nine points and facilitated two nasty lob dunks – which is an art form previous Bulls point guards rarely displayed. &lt;/p&gt;&lt;p&gt;More importantly, his speed and shiftiness were on full display, which is also an element that’s been missing from Donovan’s offense for years.&lt;/p&gt;&lt;p&gt;Ayo Dosunmu was fast but more straight-line speed. Coby White used his strong frame to drive to the rim. Josh Giddey has positional size. Even Lonzo Ball wasn’t considered a shifty point guard.&lt;br&gt;Dillingham not only has quickness, but a wiggle to him. That’s what Donovan has to bring out and elevate.&lt;/p&gt;&lt;p&gt;“At times we’ve struggled to get downhill,” Donovan said. “He’s the one guy when the ball is in his hand that can really break people down, play off the dribble, and put some pressure on the basket.”&lt;/p&gt;&lt;p&gt;With all that said, Donovan also wants to get to the bottom of what went wrong between guard and former team.&lt;/p&gt;&lt;p&gt;A talk is coming and hopefully some honesty with it.&lt;/p&gt;&lt;p&gt;“Minnesota has been trying to find another guard to take another step,” Donovan said. “They’ve been to the Western Conference Finals, so I’m looking forward to talking to him, like, ‘Why weren’t you playing because they were looking for somebody?’ This is an area of growth for him where he’s on a team that is trying to win, going for it right now, and they’re looking for some help.&lt;/p&gt;&lt;p&gt;“This is my whole point with young players. They’ve got to be able to understand things that go into winning. And I’m not saying that Rob does or does not. Maybe they didn’t like the way the team was structured, and he wasn’t the right fit, I don’t know what it was. But all these guys, these draft picks, they’ve got to impact winning at some point and move past just the talent. It’s more of how do you impact winning?”&lt;/p&gt;&lt;p&gt;The good news for both Donovan and Dillingham is they at least have time to figure that out.&lt;/p&gt;&lt;p&gt;Of the four new guards acquired, both Collin Sexton and Anfernee Simons are unrestricted free agents, and Jaden Ivey is restricted. Dillingham is only in Year 2 of his rookie contract. That means he’ll get an opportunity he wasn’t getting with Minnesota and do so in a more up-tempo offense.&lt;/p&gt;&lt;p&gt;That’s all he can ask for.&lt;/p&gt;&lt;p&gt;“Opportunity is really however many minutes I get,” Dillingham said. “Whether I get five, 10, 15, 20, just trying to play and do the most with my opportunity.&lt;/p&gt;&lt;p&gt;“Coach said he feels like it’s a better offense I can run and will be helpful for me. I just want to fit in.”&lt;/p&gt;",
      "author": "Joe Cowley",
      "id": "https://chicago.suntimes.com/bulls/2026/02/08/new-bull-rob-dillingham-search-confidence-stripped-away",
      "tags": []
    },
    {
      "title": "Michael O'Brien's Super 25 high school basketball rankings for Feb. 8, 2026",
      "link": "https://chicago.suntimes.com/super-25-basketball-rankings/2026/02/08/high-school-basketball-rankings-chicago-illinois-sun-times-michael-obrien",
      "published": "2026-02-08T13:35:08.446-06:00",
      "published_parsed": "2026-02-08T19:35:08",
      "summary": "<img alt=\"Lincoln Park's Ahmad Lee (3) moves the ball against Mount Carmel's Dominic Scalise (11).\" src=\"https://cst.brightspotcdn.com/dims4/default/9056f63/2147483647/strip/true/crop/5901x3936+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F38%2F40%2F8067278b4de592b2698210439bcc%2Fob-cst-011126-024.jpg\" />\n        \n        \n            &lt;p&gt;Bolingbrook and Kenwood lost major stars to prep schools in the spring, and schools all over the area saw significant players move on to other states at some point before the season. With the current transfer trends there is very little guarantee that the team a school features in June winds up on the court in November.&lt;/p&gt;&lt;p&gt;&lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/high-school-basketball/2026/02/06/joliet-west-basketball-ryan-lipke\"   &gt;Joliet West&lt;/a&gt; was hit especially hard by late transfers. Seniors Ethan Hillsman, Kendall Bosby and Mickeis Johnson all transferred. The Tigers had lost seniors Jamarri Fears and Rajan Roberts in previous years. That's a full Super 25-caliber starting lineup that never materialized.&lt;/p&gt;&lt;p&gt;Aamir Shannon is probably the only player in coach Jeremy Kreiger's current starting lineup that would have battled that group for a starting role. And Shannon began this season working back into full shape after an injury.&lt;/p&gt;&lt;p&gt;But the Tigers have persevered, and the remaining players have continued to improve, and now the team is playing like a sectional contender.&lt;/p&gt;&lt;p&gt;\"Bosby, Mickeis and Ethan were our focal points,\" Kreiger said. \"Now there are other guys that are trusted to take nine to 11 shots a game and they can make them.\"&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-c70000\" name=\"image-c70000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/9317c4b/2147483647/strip/true/crop/2000x1122+0+0/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F19%2F06%2Ff09e0b1a43d0a8f40e87782ad902%2Fob-cst-020726-7005.jpg 1x,https://cst.brightspotcdn.com/dims4/default/9bdc21a/2147483647/strip/true/crop/2000x1122+0+0/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F19%2F06%2Ff09e0b1a43d0a8f40e87782ad902%2Fob-cst-020726-7005.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/8b8ffca/2147483647/strip/true/crop/2000x1122+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F19%2F06%2Ff09e0b1a43d0a8f40e87782ad902%2Fob-cst-020726-7005.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Joliet West&amp;#x27;s Aamir Shannon (0) drives toward the basket as Plainfield East&amp;#x27;s Chris Tchoffa (5) defends.\" srcset=\"https://cst.brightspotcdn.com/dims4/default/8b8ffca/2147483647/strip/true/crop/2000x1122+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F19%2F06%2Ff09e0b1a43d0a8f40e87782ad902%2Fob-cst-020726-7005.jpg 1x,https://cst.brightspotcdn.com/dims4/default/4c002aa/2147483647/strip/true/crop/2000x1122+0+0/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F19%2F06%2Ff09e0b1a43d0a8f40e87782ad902%2Fob-cst-020726-7005.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/8b8ffca/2147483647/strip/true/crop/2000x1122+0+0/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F19%2F06%2Ff09e0b1a43d0a8f40e87782ad902%2Fob-cst-020726-7005.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Joliet West’s Aamir Shannon (0) drives toward the basket as Plainfield East’s Chris Tchoffa (5) defends.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Allen Cunningham/For the Sun-Times&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;Senior Brockton Goehrke has stepped up as point guard, and senior Deven Triplett is a major scoring threat. Shannon has his full athleticism back now and 6-7 Ryan Lipke, a transfer from Providence, gives Joliet West a threat in the post and from three-point range. Sophomore Abrey Robinson has provided a spark off the bench.&lt;/p&gt;&lt;p&gt;\"We have tried to infuse them with confidence,\" Kreiger said. [Shannon, Luke Grevengoed and Goehrke] were defensive specialists and guys who spaced the floor. Now they are asked to be lead ball handlers.\"&lt;/p&gt;&lt;p&gt;Shannon has watched all the changes and played a key part in steadying the ship this season.&lt;/p&gt;&lt;p&gt;\"Everybody needed some time to mature mentally in their new roles,\" Shannon said. \"But they've figured out how to fill their purpose and do their jobs.\"&lt;/p&gt;&lt;p&gt;The Tigers (18-8) have won 11 of their last 12 games. The only loss in the stretch was at Bolingbrook in overtime.&lt;/p&gt;&lt;h3&gt;Super 25 updates&lt;/h3&gt;&lt;p&gt;Two teams having solid seasons picked up big wins this week and joined the rankings. Lincoln Park, which opened the season at No. 16, has gone through some struggles this year but may be peaking at the right time. The Lions knocked off highly-regarded Peoria Richwoods over the weekend and slot in at No. 24 this &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/super-25-basketball-rankings/2026/02/01/high-school-basketball-rankings-chicago-illinois-sun-times-michael-obrien\"   &gt;Super 25&lt;/a&gt;week. They take on Clark in the Public League Playoffs on Thursday at Simeon.&lt;/p&gt;&lt;p&gt;Hillcrest dominated Kenwood 67-45 on Saturday and recently took Curie down to the wire in a 58-56 loss. The Hawks make their Super 25 season debut this week at No. 25&lt;/p&gt;&lt;p&gt;York and Stevenson drop out of the rankings. The Dukes lost to Lyons and Stevenson dropped games to Lake Forest and Warren.&lt;/p&gt;&lt;h3&gt;All-Area and All-City nominations&lt;/h3&gt;&lt;p&gt;Coaches and athletic directors, please email your All-Are and All-City nominations to mobrien@suntimes.com. Every team in the Sun-Times’ coverage area of nearly 400 schools is eligible. Sending statistics and other relevant information helps make a case for your player. Please limit your nominations to two players.&lt;/p&gt;&lt;p&gt;The All-City team will consist of four teams of five players from public and private schools in the Chicago city limits. The All-Area team is the 20 best players in the Sun-Times’ coverage area.&lt;/p&gt;&lt;p&gt;&lt;b&gt;Super 25 high school basketball rankings for Feb. 8, 2026&lt;/b&gt;&lt;br&gt;With record and last week's ranking&lt;/p&gt;&lt;p&gt;&lt;b&gt;1. Benet (26-1) 1&lt;/b&gt;&lt;br&gt;At Nazareth Friday&lt;/p&gt;&lt;p&gt;&lt;b&gt;2. DePaul Prep (22-3) 2&lt;/b&gt;&lt;br&gt;Took down St. Laurence&lt;/p&gt;&lt;p&gt;&lt;b&gt;3. Curie (22-1) 3&lt;/b&gt;&lt;br&gt;Into CPS Sweet 16&lt;/p&gt;&lt;p&gt;&lt;b&gt;4. Kankakee (22-1) 4&lt;/b&gt;&lt;br&gt;Handled Hyde Park&lt;/p&gt;&lt;p&gt;&lt;b&gt;5. Warren (24-2) 5&lt;/b&gt;&lt;br&gt;Jaxson Davis cracks 2,000&lt;/p&gt;&lt;p&gt;&lt;b&gt;6. Neuqua Valley (26-1) 6&lt;/b&gt;&lt;br&gt;At DeKalb Friday&lt;/p&gt;&lt;p&gt;&lt;b&gt;7. Homewood-Flossmoor (22-3) 7&lt;/b&gt;&lt;br&gt;Hosts Joliet West Saturday&lt;/p&gt;&lt;p&gt;&lt;b&gt;8. Bolingbrook (20-7) 8&lt;/b&gt;&lt;br&gt;Beaten heavily in O'Fallon&lt;/p&gt;&lt;p&gt;&lt;b&gt;9. Loyola (21-6) 13&lt;/b&gt;&lt;br&gt;Nice win at St. Patrick&lt;/p&gt;&lt;p&gt;&lt;b&gt;10. St. Patrick (21-4) 9&lt;/b&gt;&lt;br&gt;Mike Bailey wins 700&lt;/p&gt;&lt;p&gt;&lt;b&gt;11. Marist (24-4) 10&lt;/b&gt;&lt;br&gt;At Joliet Catholic Friday&lt;/p&gt;&lt;p&gt;&lt;b&gt;12. Evanston (22-5) 11&lt;/b&gt;&lt;br&gt;Lost to Warren&lt;/p&gt;&lt;p&gt;&lt;b&gt;13. Fremd (22-2) 16&lt;/b&gt;&lt;br&gt;Beat New Trier&lt;/p&gt;&lt;p&gt;&lt;b&gt;14. St. Ignatius (24-4) 15&lt;/b&gt;&lt;br&gt;Beat Mount Carmel&lt;/p&gt;&lt;p&gt;&lt;b&gt;15. Palatine (23-4) 17&lt;/b&gt;&lt;br&gt;Beat Cary-Grove&lt;/p&gt;&lt;p&gt;&lt;b&gt;16. Mount Carmel (16-10) 12&lt;/b&gt;&lt;br&gt;At Brother Rice Friday&lt;/p&gt;&lt;p&gt;&lt;b&gt;17. Kaneland (25-0) 19&lt;/b&gt;&lt;br&gt;Survived Sycamore again&lt;/p&gt;&lt;p&gt;&lt;b&gt;18. Young (20-6) 18&lt;/b&gt;&lt;br&gt;Tough Sweet 16 opener&lt;/p&gt;&lt;p&gt;&lt;b&gt;19. Glenbard East (24-3) 14&lt;/b&gt;&lt;br&gt;Lost to Riverside-Brookfield&lt;/p&gt;&lt;p&gt;&lt;b&gt;20. New Trier (20-7) 21&lt;/b&gt;&lt;br&gt;Hosts Evanston Friday&lt;/p&gt;&lt;p&gt;&lt;b&gt;21. Lockport (22-4) 22&lt;/b&gt;&lt;br&gt;At Sandburg Tuesday&lt;/p&gt;&lt;p&gt;&lt;b&gt;22. Leo (20-4) 23&lt;/b&gt;&lt;br&gt;At Rich Monday&lt;/p&gt;&lt;p&gt;&lt;b&gt;23. Waukegan (19-7) 25&lt;/b&gt;&lt;br&gt;Handled Libertyville&lt;/p&gt;&lt;p&gt;&lt;b&gt;24. Lincoln Park (17-7) NR&lt;/b&gt;&lt;br&gt;Beat Richwoods&lt;/p&gt;&lt;p&gt;&lt;b&gt;25. Hillcrest (17-7) NR&lt;/b&gt;&lt;br&gt;Dominated Kenwood&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n    &lt;div class=\"HtmlModule\"&gt;&lt;a class=\"AnchorLink\" id=\"html-embed-module-3d0000\" name=\"html-embed-module-3d0000\"&gt;&lt;/a&gt;&lt;iframe title=\"No Shot Clock, Ep. 200: The Stock Report\" allowtransparency=\"true\" height=\"150\" width=\"100%\" style=\"border: none; min-width: min(100%, 430px);height:150px;\" scrolling=\"no\" data-name=\"pb-iframe-player\" src=\"https://www.podbean.com/player-v2/?i=c8wjb-1a372d3-pb&amp;from=pb6admin&amp;share=1&amp;download=1&amp;rtl=0&amp;fonts=Arial&amp;skin=1&amp;font-color=auto&amp;logo_link=episode_page&amp;btn-skin=c73a3a\" loading=\"lazy\"&gt;&lt;/iframe&gt;\n&lt;/div&gt;\n\n&lt;/div&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Michael O'Brien",
      "id": "https://chicago.suntimes.com/super-25-basketball-rankings/2026/02/08/high-school-basketball-rankings-chicago-illinois-sun-times-michael-obrien",
      "tags": []
    },
    {
      "title": "NBC announces Cubs great Anthony Rizzo will be part of its MLB coverage",
      "link": "https://chicago.suntimes.com/sports-media/2026/02/08/nbc-cubs-anthony-rizzo-mlb-clayton-kershaw-joey-votto-bob-costas-ahmed-fareed-sam-flood",
      "published": "2026-02-08T13:30:30.338-06:00",
      "published_parsed": "2026-02-08T19:30:30",
      "summary": "<img alt=\"Anthony Rizzo flips a ball on Field 1 at the Cubs Spring Training facility in Mesa, AZ on February 17, 2020. \" src=\"https://cst.brightspotcdn.com/dims4/default/a076159/2147483647/strip/true/crop/3600x2400+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fc2%2F59%2F01e0389246d59b089e3090d67c43%2Fst20-rizzo-04-8x12.jpg\" />\n        \n        \n            &lt;p&gt;Cubs fans will be seeing more of Anthony Rizzo — on TV.&lt;/p&gt;&lt;p&gt;During its Super Bowl pregame show Sunday, NBC announced that Rizzo, Clayton Kershaw and Joey Votto will be part of its MLB coverage, which begins this season. &lt;/p&gt;&lt;p&gt;The trio will serve as pregame analysts for NBC's coverage of the wild-card round, and they'll appear on select pregame shows for \"Sunday Night Baseball\" broadcasts with hosts Bob Costas and Ahmed Fareed. The network's games will appear across NBC, NBCSN and Peacock.&lt;/p&gt;&lt;p&gt;“We’re excited to welcome Clayton, Anthony and Joey, three stars right off the field who can provide fresh perspective on the players, teams, and everything that makes baseball special,” NBC Sports executive producer and president of production Sam Flood said. “We look forward to rolling out some new concepts to take advantage of the unique insights of each analyst, beginning on Opening Day.”&lt;/p&gt;&lt;p&gt;Rizzo, a three-time All-Star and four-time Gold Glove winner, was the face of the Cubs' 2016 World Series championship team, the franchise's first since 1908. He slashed .360/.484/.600 in that World Series.&lt;/p&gt;&lt;p&gt;NBC is beginning a three-year deal to carry what was ESPN's baseball package, which includes Sunday night games and every wild-card series. NBC also regained the \"MLB Sunday Leadoff\" package of early Sunday games, which will be exclusive to streaming service Peacock. The network's coverage will debut on Opening Day, March 26, with Pirates-Mets at noon and Diamondbacks-Dodgers at 7 p.m., when the Dodgers will raise their World Series banner.&lt;/p&gt;&lt;p&gt;Rizzo's Cubs are scheduled for two appearances on Sunday nights: May 31 at the Cardinals and June 7 against the Giants. They also are part of a Sunday doubleheader Aug. 3 with a 2 p.m. game against the Reds. All three games will air on NBC and Peacock.&lt;/p&gt;",
      "author": "Jeff Agrest",
      "id": "https://chicago.suntimes.com/sports-media/2026/02/08/nbc-cubs-anthony-rizzo-mlb-clayton-kershaw-joey-votto-bob-costas-ahmed-fareed-sam-flood",
      "tags": []
    },
    {
      "title": "Former Bears GM Ryan Pace out of Falcons' front office: report",
      "link": "https://chicago.suntimes.com/bears/2026/02/08/former-bears-gm-ryan-pace-out-of-falcons-front-office-report",
      "published": "2026-02-08T13:00:59.901-06:00",
      "published_parsed": "2026-02-08T19:00:59",
      "summary": "<img alt=\"Chicago Bears general manager Ryan Pace listens through the door way as Chicago Bears head coach John Fox speaks during a news conference after an NFL football game against the Minnesota Vikings, Monday, Oct. 9, 2017, in Chicago. (AP Photo/Charles Rex Arbogast) ORG XMIT: CXB1\" src=\"https://cst.brightspotcdn.com/dims4/default/7fae163/2147483647/strip/true/crop/3098x2208+0+0/resize/840x599!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F6f%2Fed%2F84ecb8bc47c29cfc92ad01fb3634%2Fpace-19.JPG\" />\n        \n        \n            &lt;p&gt;New management for the Falcons meant the departure of former Bears general manager Ryan Pace. Pace, who was vice president of football operations, is out following the arrival new president of football Matt Ryan and general manager Ian Cunningham, NFL Network reported. It was unclear whether he was fired or they parted mutually.&lt;/p&gt;&lt;p&gt;The Falcons went 30-38 during Pace’s time in their front office under former general manager Terry Fontenot.&lt;/p&gt;&lt;p&gt;Pace, 48, got his first shot at being a general manager when the Bears hired him in 2015 after a long run as a Saints scout and executive. Both of his head-coaching hires, John Fox and Matt Nagy, were fired in four seasons or fewer. Both of his first-round picks at quarterback, Mitch Trubisky and Justin Fields, failed to establish themselves and earn a second contract with the team.&lt;/p&gt;&lt;p&gt;The Bears went 48-65 with two playoff appearances under Pace (one for going 8-8 in 2020), and he left them in shambles when they fired him after the 2021 season. New general manager Ryan Poles inherited a team that had spent itself into a salary-cap mess and mortgaged its future draft capital, prompting him to do a full teardown in 2022.&lt;/p&gt;&lt;p&gt;The only players left on the Bears’ roster from the Pace era are kicker Cairo Santos, tight end Cole Kmet and cornerback Jaylon Johnson.&lt;/p&gt;",
      "author": "Jason Lieser",
      "id": "https://chicago.suntimes.com/bears/2026/02/08/former-bears-gm-ryan-pace-out-of-falcons-front-office-report",
      "tags": []
    },
    {
      "title": "Waukegan police fatally shot man who attempted suicide",
      "link": "https://chicago.suntimes.com/crime/2026/02/08/waukegan-police-fatally-shot-man",
      "published": "2026-02-08T12:32:35.09-06:00",
      "published_parsed": "2026-02-08T18:32:35",
      "summary": "<img alt=\"Waukegan police shot and killed a man who attempted suicide Saturday afternoon, authorities said.\" src=\"https://cst.brightspotcdn.com/dims4/default/bf9276b/2147483647/strip/true/crop/1600x1320+0+0/resize/840x693!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fbf%2Fdb%2Fed5ca2624f44000e906d0788cbe4%2Fwaukegan.jpeg\" />\n        \n        \n            &lt;p&gt;Waukegan police shot and killed a man who attempted suicide Saturday afternoon. &lt;/p&gt;&lt;p&gt;Three officers responded to a call around 3 p.m. in the 1000 block of Leith Avenue for a person \"who had attempted to commit suicide,\" Waukegan Police said in a news release.&lt;/p&gt;&lt;p&gt;The shooting victim was a 58-year-old Waukegan man. First responders provided aid, but he died at the scene, according to police. The department did not provide details of what led to the shooting.&lt;/p&gt;&lt;p&gt;The Illinois State Police are investigating the incident.&lt;/p&gt;",
      "author": "Sun-Times Wire",
      "id": "https://chicago.suntimes.com/crime/2026/02/08/waukegan-police-fatally-shot-man",
      "tags": []
    },
    {
      "title": "Review: Steppenwolf‘s ‘Dance of Death’ finds humor in the portrayal of deep unhappiness",
      "link": "https://chicago.suntimes.com/theater/2026/02/08/review-steppenwolf-theatre-dance-of-death-jeff-perry-kathryn-erbe",
      "published": "2026-02-08T17:42:15.169-06:00",
      "published_parsed": "2026-02-08T23:42:15",
      "summary": "<img alt=\"Jeff Perry and Kathryn Erbe portray married couple Edgar and Alice in Steppenwolf Theatre Company’s production of “The Dance of Death.”\" src=\"https://cst.brightspotcdn.com/dims4/default/28fd997/2147483647/strip/true/crop/1800x1200+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1f%2F83%2F018a19664739a017f382d8bf7975%2Fthe-dance-of-death-1-photo-by-michael-brosilow.jpg\" />\n        \n        \n            &lt;p&gt;“I know that particular feeling…, ” says the character Curt, a friendly yet appalled observer of the miserable, ever-battling married couple at the core of “The Dance of Death,” an August Strindberg classic written in 1900. “Hate and love forged together in the foundry of hell.”&lt;/p&gt;&lt;p&gt;Surprisingly, in a new Steppenwolf Theatre production, this depressingly honest description of the central relationship comes across as a laugh line.&lt;/p&gt;&lt;p&gt;Finding humor in the portrayal of deep unhappiness turns out to be the key that unlocks this emotionally and stylistically complicated play. It results in a show as deliriously entertaining as it is astonishingly profound.&lt;/p&gt;&lt;div class=\"RatingCard Enhancement\" data-module data-rating=\"4.0\"  data-align-center&gt;\n    \n    &lt;div class=\"RatingCard-title\"&gt;\n        ‘Dance of Death’\n    &lt;/div&gt;\n    \n\n    &lt;div class=\"RatingCard-content\"&gt;\n        &lt;span class=\"RatingCard-star\"&gt;\n    &lt;span class=\"RatingCard-star-full\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n\n    &lt;span class=\"RatingCard-star-half\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n&lt;/span&gt;\n        &lt;span class=\"RatingCard-star\"&gt;\n    &lt;span class=\"RatingCard-star-full\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n\n    &lt;span class=\"RatingCard-star-half\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n&lt;/span&gt;\n        &lt;span class=\"RatingCard-star\"&gt;\n    &lt;span class=\"RatingCard-star-full\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n\n    &lt;span class=\"RatingCard-star-half\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n&lt;/span&gt;\n        &lt;span class=\"RatingCard-star\"&gt;\n    &lt;span class=\"RatingCard-star-full\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n\n    &lt;span class=\"RatingCard-star-half\"&gt;\n        &lt;svg class=\"\"&gt;\n            &lt;use xlink:href=\"#icon-star\"&gt;&lt;/use&gt;\n        &lt;/svg&gt;\n    &lt;/span&gt;\n&lt;/span&gt;\n    &lt;/div&gt;\n&lt;/div&gt;&lt;p&gt;&lt;/p&gt;&lt;div class=\"RichTextSidebarModule Enhancement\" data-module data-align-center&gt;&lt;a class=\"AnchorLink\" id=\"module-ad0000\" name=\"module-ad0000\"&gt;&lt;/a&gt;\n\n    \n\n    \n    &lt;div class=\"RichTextModule-items RichTextBody\"&gt;&lt;b&gt;When:&lt;/b&gt; Through March 22&lt;br&gt;&lt;b&gt;Where:&lt;/b&gt; Steppenwolf Theater, 1650 N. Halsted St.&lt;br&gt;&lt;b&gt;Tickets:&lt;/b&gt; $20-$148.50&lt;br&gt;&lt;b&gt;Info:&lt;/b&gt; &lt;a class=\"Link\"  href=\"https://www.steppenwolf.org/\"  target=\"_blank\"   &gt;steppenwolf.org&lt;/a&gt;&lt;br&gt;&lt;b&gt;Run time:&lt;/b&gt; 2 hours and 20 minutes with one intermission&lt;br&gt;&lt;/div&gt;\n\n\n&lt;/div&gt;&lt;p&gt;It’s always been fair to consider this work — often considered an inspiration for Edward Albee’s bad-marriage exemplar “Who’s Afraid of Virginia Woolf? — a dark comedy, but a budding one, more heavy than comic, more earnest than ridiculous, more Nietzsche (a frequent Strindberg pen pal) than, say, Ionesco or Beckett.&lt;/p&gt;&lt;p&gt;Not here.&lt;/p&gt;&lt;p&gt;Director Yasen Peyankov, helped by Conor McPherson’s translation/adaptation and an unimprovable cast, goes full bore into the funny, which, bizarrely, makes the marriage just as hellish yet far more understandable, and the play more psychologically real and raw.&lt;/p&gt;&lt;p&gt;Edgar (Jeff Perry) and Alice (Kathryn Erbe) are about to celebrate — or rather, rue — their silver anniversary. Edgar is a middling military officer at a garrison on a small island, where he dislikes everyone as much as they dislike him: “Was ever a greater horde of imbeciles crowded into so small a space?” he asks.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-4d0000\" name=\"image-4d0000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/5b3b221/2147483647/strip/true/crop/1800x1010+0+137/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F69%2Ff37e52764c7fa697a9ad6ce52148%2Fthe-dance-of-death-10-photo-by-michael-brosilow.jpg 1x,https://cst.brightspotcdn.com/dims4/default/2ad4606/2147483647/strip/true/crop/1800x1010+0+137/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F69%2Ff37e52764c7fa697a9ad6ce52148%2Fthe-dance-of-death-10-photo-by-michael-brosilow.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/5487f60/2147483647/strip/true/crop/1800x1010+0+137/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F69%2Ff37e52764c7fa697a9ad6ce52148%2Fthe-dance-of-death-10-photo-by-michael-brosilow.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"The Dance of Death 10. Photo by Michael Brosilow.jpg\" srcset=\"https://cst.brightspotcdn.com/dims4/default/5487f60/2147483647/strip/true/crop/1800x1010+0+137/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F69%2Ff37e52764c7fa697a9ad6ce52148%2Fthe-dance-of-death-10-photo-by-michael-brosilow.jpg 1x,https://cst.brightspotcdn.com/dims4/default/4f6bb87/2147483647/strip/true/crop/1800x1010+0+137/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F69%2Ff37e52764c7fa697a9ad6ce52148%2Fthe-dance-of-death-10-photo-by-michael-brosilow.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/5487f60/2147483647/strip/true/crop/1800x1010+0+137/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F28%2F69%2Ff37e52764c7fa697a9ad6ce52148%2Fthe-dance-of-death-10-photo-by-michael-brosilow.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;From left, Cliff Chamberlain, Kathryn Erbe and Jeff Perry in Steppenwolf Theatre’s production of “The Dance of Death.” Alice and Edgar’s one pleasure is for Alice to play a march on the piano that Edgar dances to.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Michael Brosilow&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;So he spends nearly all his time with Alice in their home, which — in Collette Pollard’s set design — possesses all the concrete charmlessness of a prison, which it used to be. Alice, a former actress who has better manners, perhaps, but shares her husband’s haughty superiority to their neighbors, manages to insult her servants to the point that they leave and then bemoans the wear on her hands from housework she doesn’t seem to do.&lt;/p&gt;&lt;p&gt;She insults Edgar even more, and he returns the favor.&lt;/p&gt;&lt;p&gt;Their one pleasure, likely done daily, is for Alice to play a march on the piano that Edgar dances to.&lt;/p&gt;&lt;p&gt;The dance epitomizes Perry’s unique take on Edgar — it’s kooky yet committed. Like so much of what Edgar does in this play, Perry makes it impossible to know whether the character takes the dance seriously or is being purposefully silly, just as nobody can ever tell whether he’s telling the truth, even when he’s clutching his heart or his head in pain.&lt;/p&gt;&lt;p&gt;That includes Alice, but even more so the third wheel in the play, Alice’s cousin Curt (Cliff Chamberlain), who introduced the couple before his own difficult divorce led him to leave the country. He has returned to establish a quarantine ward on the island. His arrival provides a new opportunity — perhaps the first since they sent their two children to boarding school — for the couple to compete for someone’s sympathy, demanding in essence that he take sides in their ongoing warfare, which they relish as much as they despise.&lt;/p&gt;&lt;p&gt;The performances are all extraordinary and, essentially, intertwined. This really is Steppenwolf acting at its very best, and that’s saying a whole lot. It’s quirkily personal, wholly involved, thoroughly in the moment, unafraid of embracing the characters’ darkest instincts, deepest guilt or strangest desires.&lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-1e0000\" name=\"image-1e0000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/4dcf742/2147483647/strip/true/crop/1800x1010+0+118/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F6a%2F0510c2b6433ebc8d9408267ebeee%2Fthe-dance-of-death-6-photo-by-michael-brosilow.jpg 1x,https://cst.brightspotcdn.com/dims4/default/1d507f1/2147483647/strip/true/crop/1800x1010+0+118/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F6a%2F0510c2b6433ebc8d9408267ebeee%2Fthe-dance-of-death-6-photo-by-michael-brosilow.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/a742885/2147483647/strip/true/crop/1800x1010+0+118/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F6a%2F0510c2b6433ebc8d9408267ebeee%2Fthe-dance-of-death-6-photo-by-michael-brosilow.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"The Dance of Death 6. Photo by Michael Brosilow.jpg\" srcset=\"https://cst.brightspotcdn.com/dims4/default/a742885/2147483647/strip/true/crop/1800x1010+0+118/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F6a%2F0510c2b6433ebc8d9408267ebeee%2Fthe-dance-of-death-6-photo-by-michael-brosilow.jpg 1x,https://cst.brightspotcdn.com/dims4/default/1044b10/2147483647/strip/true/crop/1800x1010+0+118/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F6a%2F0510c2b6433ebc8d9408267ebeee%2Fthe-dance-of-death-6-photo-by-michael-brosilow.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/a742885/2147483647/strip/true/crop/1800x1010+0+118/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F6a%2F0510c2b6433ebc8d9408267ebeee%2Fthe-dance-of-death-6-photo-by-michael-brosilow.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Ensemble members Cliff Chamberlain , Jeff Perry and Kathryn Erbe in Steppenwolf Theatre Company’s production of “The Dance of Death.”&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Michael Brosilow&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;Peyankov matches their fearlessness, letting the style of this work be so many different things at once while making it all feel like it couldn’t be any other way. It’s naturalistic — these are real people in a real place and time confronting and confused by real emotions that they couldn’t explain even if they wanted to. It’s expressionistic — in Rick Sims’ sound design, Edgar seems to be chased by a voice calling him to the grave. It’s absurdist — Edgar and Alice, like Vladimir and Estragon in “Waiting for Godot,” seem above all to simply be desperately filling the time in a world where purpose is a punch line.&lt;/p&gt;&lt;p&gt;It’s certainly not a coincidence that Perry’s hair and mustache are styled to resemble portraits of Strindberg himself. What emerges so clearly here is the deep and direct engagement of interpretive artists — directors, actors, designers, even the adapter — with the source creator, and not with the preconceived notions that have built up around him.&lt;/p&gt;&lt;p&gt;The Swedish Strindberg himself bore plenty of suffering, many of the details reflected in various plot points of “Dance of Death.” But one thing I now know for sure. He developed, or maintained, a deeply dark sense of humor.&lt;/p&gt;&lt;p&gt;I’ll never see his work the same way again.&lt;/p&gt;",
      "author": "Steven Oxman | For the Sun-Times",
      "id": "https://chicago.suntimes.com/theater/2026/02/08/review-steppenwolf-theatre-dance-of-death-jeff-perry-kathryn-erbe",
      "tags": []
    },
    {
      "title": "SWAT team responds to Northwest Side incident",
      "link": "https://chicago.suntimes.com/crime/2026/02/08/chicago-police-swat-northwest-side",
      "published": "2026-02-08T15:29:03.483-06:00",
      "published_parsed": "2026-02-08T21:29:03",
      "summary": "<img alt=\"Officers were on the scene of a SWAT incident in the 7100 block of North Sioux Avenue around 10:20 a.m. Sunday, Chicago police said.\" src=\"https://cst.brightspotcdn.com/dims4/default/2fb7b55/2147483647/strip/true/crop/806x507+0+0/resize/840x528!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1b%2Fd8%2F3824ff41e660ee752e5d5f448fa6%2Fgen-cop.jpg\" />\n        \n        \n            &lt;p&gt;Chicago police responded to a SWAT incident Sunday in the Northwest Side's Forest Glen neighborhood.&lt;/p&gt;&lt;p&gt;Officers were on the scene in the 7100 block of North Sioux Avenue around 10:20 a.m., Chicago police said. No additional information was immediately available.&lt;/p&gt;",
      "author": "Sun-Times Wire",
      "id": "https://chicago.suntimes.com/crime/2026/02/08/chicago-police-swat-northwest-side",
      "tags": []
    }
  ],
  "last_updated": "2026-02-10T18:21:21.874923"
}